MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
#define ADC_DAT10_RESULT_Pos             (0)                                               /*!< ADC_T::DAT: RESULT Position             */
#define ADC_DAT10_RESULT_Msk             (0xfffful << ADC_DAT10_RESULT_Pos)                /*!< ADC_T::DAT: RESULT Mask                 */

#define ADC_DAT10_OV_Pos                 (16)                                              /*!< ADC_T::DAT: OV Position                 */
#define ADC_DAT10_OV_Msk                 (0x1ul << ADC_DAT10_OV_Pos)                       /*!< ADC_T::DAT: OV Mask                     */

#define ADC_DAT10_VALID_Pos              (17)                                              /*!< ADC_T::DAT: VALID Position              */
#define ADC_DAT10_VALID_Msk              (0x1ul << ADC_DAT10_VALID_Pos)                    /*!< ADC_T::DAT: VALID Mask                  */

#define ADC_DAT11_RESULT_Pos             (0)                                               /*!< ADC_T::DAT: RESULT Position             */
#define ADC_DAT11_RESULT_Msk             (0xfffful << ADC_DAT11_RESULT_Pos)                /*!< ADC_T::DAT: RESULT Mask                 */

#define ADC_DAT11_OV_Pos                 (16)                                              /*!< ADC_T::DAT: OV Position                 */
#define ADC_DAT11_OV_Msk                 (0x1ul << ADC_DAT11_OV_Pos)                       /*!< ADC_T::DAT: OV Mask                     */

#define ADC_DAT11_VALID_Pos              (17)                                              /*!< ADC_T::DAT: VALID Position              */
#define ADC_DAT11_VALID_Msk              (0x1ul << ADC_DAT11_VALID_Pos)                    /*!< ADC_T::DAT: VALID Mask                  */

#define ADC_DAT12_RESULT_Pos             (0)                                               /*!< ADC_T::DAT: RESULT Position             */
#define ADC_DAT12_RESULT_Msk             (0xfffful << ADC_DAT12_RESULT_Pos)                /*!< ADC_T::DAT: RESULT Mask                 */

#define ADC_DAT12_OV_Pos                 (16)                                              /*!< ADC_T::DAT: OV Position                 */
#define ADC_DAT12_OV_Msk                 (0x1ul << ADC_DAT12_OV_Pos)                       /*!< ADC_T::DAT: OV Mask                     */

#define ADC_DAT12_VALID_Pos              (17)                                              /*!< ADC_T::DAT: VALID Position              */
#define ADC_DAT12_VALID_Msk              (0x1ul << ADC_DAT12_VALID_Pos)                    /*!< ADC_T::DAT: VALID Mask                  */

#define ADC_DAT13_RESULT_Pos             (0)                                               /*!< ADC_T::DAT: RESULT Position             */
#define ADC_DAT13_RESULT_Msk             (0xfffful << ADC_DAT13_RESULT_Pos)                /*!< ADC_T::DAT: RESULT Mask                 */

#define ADC_DAT13_OV_Pos                 (16)                                              /*!< ADC_T::DAT: OV Position                 */
#define ADC_DAT13_OV_Msk                 (0x1ul << ADC_DAT13_OV_Pos)                       /*!< ADC_T::DAT: OV Mask                     */

#define ADC_DAT13_VALID_Pos              (17)                                              /*!< ADC_T::DAT: VALID Position              */
#define ADC_DAT13_VALID_Msk              (0x1ul << ADC_DAT13_VALID_Pos)                    /*!< ADC_T::DAT: VALID Mask                  */

#define ADC_CTL_ADCEN_Pos                (0)                                               /*!< ADC_T::CTL: ADCEN Position                */
#define ADC_CTL_ADCEN_Msk                (0x1ul << ADC_CTL_ADCEN_Pos)                      /*!< ADC_T::CTL: ADCEN Mask                    */

#define ADC_CTL_ADCIEN_Pos               (1)                                               /*!< ADC_T::CTL: ADCIEN Position               */
#define ADC_CTL_ADCIEN_Msk               (0x1ul << ADC_CTL_ADCIEN_Pos)                     /*!< ADC_T::CTL: ADCIEN Mask                   */

#define ADC_CTL_OPMODE_Pos               (2)                                               /*!< ADC_T::CTL: OPMODE Position               */
#define ADC_CTL_OPMODE_Msk               (0x3ul << ADC_CTL_OPMODE_Pos)                     /*!< ADC_T::CTL: OPMODE Mask                   */

#define ADC_CTL_HWTRGSEL_Pos             (4)                                               /*!< ADC_T::CTL: HWTRGSEL Position             */
#define ADC_CTL_HWTRGSEL_Msk             (0x3ul << ADC_CTL_HWTRGSEL_Pos)                   /*!< ADC_T::CTL: HWTRGSEL Mask                 */

#define ADC_CTL_HWTRGCOND_Pos            (6)                                               /*!< ADC_T::CTL: HWTRGCOND Position            */
#define ADC_CTL_HWTRGCOND_Msk            (0x3ul << ADC_CTL_HWTRGCOND_Pos)                  /*!< ADC_T::CTL: HWTRGCOND Mask                */

#define ADC_CTL_HWTRGEN_Pos              (8)                                               /*!< ADC_T::CTL: HWTRGEN Position              */
#define ADC_CTL_HWTRGEN_Msk              (0x1ul << ADC_CTL_HWTRGEN_Pos)                    /*!< ADC_T::CTL: HWTRGEN Mask                  */

#define ADC_CTL_PDMAEN_Pos               (9)                                               /*!< ADC_T::CTL: PDMAEN Position               */
#define ADC_CTL_PDMAEN_Msk               (0x1ul << ADC_CTL_PDMAEN_Pos)                     /*!< ADC_T::CTL: PDMAEN Mask                   */

#define ADC_CTL_DIFFEN_Pos               (10)                                              /*!< ADC_T::CTL: DIFFEN Position               */
#define ADC_CTL_DIFFEN_Msk               (0x1ul << ADC_CTL_DIFFEN_Pos)                     /*!< ADC_T::CTL: DIFFEN Mask                   */

#define ADC_CTL_SWTRG_Pos                (11)                                              /*!< ADC_T::CTL: SWTRG Position                */
#define ADC_CTL_SWTRG_Msk                (0x1ul << ADC_CTL_SWTRG_Pos)                      /*!< ADC_T::CTL: SWTRG Mask                    */

#define ADC_CTL_PWMTRGDLY_Pos            (16)                                              /*!< ADC_T::CTL: PWMTRGDLY Position            */
#define ADC_CTL_PWMTRGDLY_Msk            (0xfful << ADC_CTL_PWMTRGDLY_Pos)                 /*!< ADC_T::CTL: PWMTRGDLY Mask                */

