MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
#define CLK_CLKDIV0_UARTDIV_Pos          (8)                                               /*!< CLK_T::CLKDIV0: UARTDIV Position          */
#define CLK_CLKDIV0_UARTDIV_Msk          (0xful << CLK_CLKDIV0_UARTDIV_Pos)                /*!< CLK_T::CLKDIV0: UARTDIV Mask              */

#define CLK_CLKDIV0_ADCDIV_Pos           (16)                                              /*!< CLK_T::CLKDIV0: ADCDIV Position           */
#define CLK_CLKDIV0_ADCDIV_Msk           (0xfful << CLK_CLKDIV0_ADCDIV_Pos)                /*!< CLK_T::CLKDIV0: ADCDIV Mask               */

#define CLK_CLKDIV0_SDHDIV_Pos           (24)                                              /*!< CLK_T::CLKDIV0: SDHDIV Position           */
#define CLK_CLKDIV0_SDHDIV_Msk           (0xfful << CLK_CLKDIV0_SDHDIV_Pos)                /*!< CLK_T::CLKDIV0: SDHDIV Mask               */

#define CLK_CLKDIV1_SC0DIV_Pos           (0)                                               /*!< CLK_T::CLKDIV1: SC0DIV Position           */
#define CLK_CLKDIV1_SC0DIV_Msk           (0xfful << CLK_CLKDIV1_SC0DIV_Pos)                /*!< CLK_T::CLKDIV1: SC0DIV Mask               */

#define CLK_CLKDIV1_SC1DIV_Pos           (8)                                               /*!< CLK_T::CLKDIV1: SC1DIV Position           */
#define CLK_CLKDIV1_SC1DIV_Msk           (0xfful << CLK_CLKDIV1_SC1DIV_Pos)                /*!< CLK_T::CLKDIV1: SC1DIV Mask               */

#define CLK_CLKDIV1_SC2DIV_Pos           (16)                                              /*!< CLK_T::CLKDIV1: SC2DIV Position           */
#define CLK_CLKDIV1_SC2DIV_Msk           (0xfful << CLK_CLKDIV1_SC2DIV_Pos)                /*!< CLK_T::CLKDIV1: SC2DIV Mask               */

#define CLK_CLKDIV1_SC3DIV_Pos           (24)                                              /*!< CLK_T::CLKDIV1: SC3DIV Position           */
#define CLK_CLKDIV1_SC3DIV_Msk           (0xfful << CLK_CLKDIV1_SC3DIV_Pos)                /*!< CLK_T::CLKDIV1: SC3DIV Mask               */

#define CLK_CLKDIV2_SC4DIV_Pos           (0)                                               /*!< CLK_T::CLKDIV2: SC4DIV Position           */
#define CLK_CLKDIV2_SC4DIV_Msk           (0xfful << CLK_CLKDIV2_SC4DIV_Pos)                /*!< CLK_T::CLKDIV2: SC4DIV Mask               */

#define CLK_CLKDIV2_SC5DIV_Pos           (8)                                               /*!< CLK_T::CLKDIV2: SC5DIV Position           */
#define CLK_CLKDIV2_SC5DIV_Msk           (0xfful << CLK_CLKDIV2_SC5DIV_Pos)                /*!< CLK_T::CLKDIV2: SC5DIV Mask               */

#define CLK_CLKDIV3_CAPDIV_Pos           (0)                                               /*!< CLK_T::CLKDIV3: CAPDIV Position          */
#define CLK_CLKDIV3_CAPDIV_Msk           (0xfful << CLK_CLKDIV3_CAPDIV_Pos)                /*!< CLK_T::CLKDIV3: CAPDIV Mask              */

#define CLK_CLKDIV3_VSENSEDIV_Pos        (8)                                               /*!< CLK_T::CLKDIV3: VSENSEDIV Position        */
#define CLK_CLKDIV3_VSENSEDIV_Msk        (0xfful << CLK_CLKDIV3_VSENSEDIV_Pos)             /*!< CLK_T::CLKDIV3: VSENSEDIV Mask            */

#define CLK_CLKDIV3_EMACDIV_Pos          (16)                                              /*!< CLK_T::CLKDIV3: EMACDIV Position          */
#define CLK_CLKDIV3_EMACDIV_Msk          (0xfful << CLK_CLKDIV3_EMACDIV_Pos)               /*!< CLK_T::CLKDIV3: EMACDIV Mask              */

#define CLK_PLLCTL_FBDIV_Pos             (0)                                               /*!< CLK_T::PLLCTL: FBDIV Position             */
#define CLK_PLLCTL_FBDIV_Msk             (0x1fful << CLK_PLLCTL_FBDIV_Pos)                 /*!< CLK_T::PLLCTL: FBDIV Mask                 */

#define CLK_PLLCTL_INDIV_Pos             (9)                                               /*!< CLK_T::PLLCTL: INDIV Position             */
#define CLK_PLLCTL_INDIV_Msk             (0x1ful << CLK_PLLCTL_INDIV_Pos)                  /*!< CLK_T::PLLCTL: INDIV Mask                 */

#define CLK_PLLCTL_OUTDV_Pos             (14)                                              /*!< CLK_T::PLLCTL: OUTDV Position             */
#define CLK_PLLCTL_OUTDV_Msk             (0x3ul << CLK_PLLCTL_OUTDV_Pos)                   /*!< CLK_T::PLLCTL: OUTDV Mask                 */

#define CLK_PLLCTL_PD_Pos                (16)                                              /*!< CLK_T::PLLCTL: PD Position                */
#define CLK_PLLCTL_PD_Msk                (0x1ul << CLK_PLLCTL_PD_Pos)                      /*!< CLK_T::PLLCTL: PD Mask                    */

#define CLK_PLLCTL_BP_Pos                (17)                                              /*!< CLK_T::PLLCTL: BP Position                */
#define CLK_PLLCTL_BP_Msk                (0x1ul << CLK_PLLCTL_BP_Pos)                      /*!< CLK_T::PLLCTL: BP Mask                    */

#define CLK_PLLCTL_OE_Pos                (18)                                              /*!< CLK_T::PLLCTL: OE Position                */
#define CLK_PLLCTL_OE_Msk                (0x1ul << CLK_PLLCTL_OE_Pos)                      /*!< CLK_T::PLLCTL: OE Mask                    */

#define CLK_PLLCTL_PLLSRC_Pos            (19)                                              /*!< CLK_T::PLLCTL: PLLSRC Position            */
#define CLK_PLLCTL_PLLSRC_Msk            (0x1ul << CLK_PLLCTL_PLLSRC_Pos)                  /*!< CLK_T::PLLCTL: PLLSRC Mask                */

#define CLK_PLLCTL_PLLREMAP_Pos          (20)                                              /*!< CLK_T::PLLCTL: PLLREMAP Position          */
#define CLK_PLLCTL_PLLREMAP_Msk          (0x1ul << CLK_PLLCTL_PLLREMAP_Pos)                /*!< CLK_T::PLLCTL: PLLREMAP Mask              */

#define CLK_PLL2CTL_PLL2DIV_Pos          (0)                                               /*!< CLK_T::PLL2CTL: PLL2DIV Position          */
#define CLK_PLL2CTL_PLL2DIV_Msk          (0xfful << CLK_PLL2CTL_PLL2DIV_Pos)               /*!< CLK_T::PLL2CTL: PLL2DIV Mask              */

#define CLK_PLL2CTL_PLL2CKEN_Pos         (8)                                               /*!< CLK_T::PLL2CTL: PLL2CKEN Position         */
#define CLK_PLL2CTL_PLL2CKEN_Msk         (0x1ul << CLK_PLL2CTL_PLL2CKEN_Pos)               /*!< CLK_T::PLL2CTL: PLL2CKEN Mask             */

#define CLK_STATUS_HXTSTB_Pos            (0)                                               /*!< CLK_T::STATUS: HXTSTB Position            */
#define CLK_STATUS_HXTSTB_Msk            (0x1ul << CLK_STATUS_HXTSTB_Pos)                  /*!< CLK_T::STATUS: HXTSTB Mask                */

#define CLK_STATUS_LXTSTB_Pos            (1)                                               /*!< CLK_T::STATUS: LXTSTB Position            */
#define CLK_STATUS_LXTSTB_Msk            (0x1ul << CLK_STATUS_LXTSTB_Pos)                  /*!< CLK_T::STATUS: LXTSTB Mask                */

#define CLK_STATUS_PLLSTB_Pos            (2)                                               /*!< CLK_T::STATUS: PLLSTB Position            */
#define CLK_STATUS_PLLSTB_Msk            (0x1ul << CLK_STATUS_PLLSTB_Pos)                  /*!< CLK_T::STATUS: PLLSTB Mask                */

#define CLK_STATUS_LIRCSTB_Pos           (3)                                               /*!< CLK_T::STATUS: LIRCSTB Position           */
#define CLK_STATUS_LIRCSTB_Msk           (0x1ul << CLK_STATUS_LIRCSTB_Pos)                 /*!< CLK_T::STATUS: LIRCSTB Mask               */

#define CLK_STATUS_HIRCSTB_Pos           (4)                                               /*!< CLK_T::STATUS: HIRCSTB Position           */
#define CLK_STATUS_HIRCSTB_Msk           (0x1ul << CLK_STATUS_HIRCSTB_Pos)                 /*!< CLK_T::STATUS: HIRCSTB Mask               */

#define CLK_STATUS_PLL2STB_Pos           (5)                                               /*!< CLK_T::STATUS: PLL2STB Position           */
#define CLK_STATUS_PLL2STB_Msk           (0x1ul << CLK_STATUS_PLL2STB_Pos)                 /*!< CLK_T::STATUS: PLL2STB Mask               */

#define CLK_STATUS_CLKSFAIL_Pos          (7)                                               /*!< CLK_T::STATUS: CLKSFAIL Position          */
#define CLK_STATUS_CLKSFAIL_Msk          (0x1ul << CLK_STATUS_CLKSFAIL_Pos)                /*!< CLK_T::STATUS: CLKSFAIL Mask              */

#define CLK_CLKOCTL_FSEL_Pos             (0)                                               /*!< CLK_T::CLKOCTL: FSEL Position             */
#define CLK_CLKOCTL_FSEL_Msk             (0xful << CLK_CLKOCTL_FSEL_Pos)                   /*!< CLK_T::CLKOCTL: FSEL Mask                 */

#define CLK_CLKOCTL_CLKOEN_Pos           (4)                                               /*!< CLK_T::CLKOCTL: CLKOEN Position           */
#define CLK_CLKOCTL_CLKOEN_Msk           (0x1ul << CLK_CLKOCTL_CLKOEN_Pos)                 /*!< CLK_T::CLKOCTL: CLKOEN Mask               */

#define CLK_CLKOCTL_DIV1EN_Pos           (5)                                               /*!< CLK_T::CLKOCTL: DIV1EN Position             */
#define CLK_CLKOCTL_DIV1EN_Msk           (0x1ul << CLK_CLKOCTL_DIV1EN_Pos)                 /*!< CLK_T::CLKOCTL: DIV1EN Mask                 */

#define CLK_CLKDCTL_SYSFDEN_Pos          (0)                                               /*!< CLK_T::CLKDCTL: SYSFDEN Position          */
#define CLK_CLKDCTL_SYSFDEN_Msk          (0x1ul << CLK_CLKDCTL_SYSFDEN_Pos)                /*!< CLK_T::CLKDCTL: SYSFDEN Mask              */

#define CLK_CLKDCTL_SYSFIEN_Pos          (1)                                               /*!< CLK_T::CLKDCTL: SYSFIEN Position          */
#define CLK_CLKDCTL_SYSFIEN_Msk          (0x1ul << CLK_CLKDCTL_SYSFIEN_Pos)                /*!< CLK_T::CLKDCTL: SYSFIEN Mask              */

