MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
    /**
     * SHA_DGST3
     * ===================================================================================================
     * Offset: 0x314  SHA Digest Message 3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DGST      |SHA Digest Message Word
     * |        |          |For SHA-160, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST4.
     * |        |          |For SHA-224, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST6.
     * |        |          |For SHA-256, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST7.
    */
    __I  uint32_t SHA_DGST3;

    /**
     * SHA_DGST4
     * ===================================================================================================
     * Offset: 0x318  SHA Digest Message 4
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DGST      |SHA Digest Message Word
     * |        |          |For SHA-160, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST4.
     * |        |          |For SHA-224, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST6.
     * |        |          |For SHA-256, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST7.
    */
    __I  uint32_t SHA_DGST4;

    /**
     * SHA_DGST5
     * ===================================================================================================
     * Offset: 0x31C  SHA Digest Message 5
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DGST      |SHA Digest Message Word
     * |        |          |For SHA-160, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST4.
     * |        |          |For SHA-224, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST6.
     * |        |          |For SHA-256, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST7.
    */
    __I  uint32_t SHA_DGST5;

    /**
     * SHA_DGST6
     * ===================================================================================================
     * Offset: 0x320  SHA Digest Message 6
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DGST      |SHA Digest Message Word
     * |        |          |For SHA-160, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST4.
     * |        |          |For SHA-224, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST6.
     * |        |          |For SHA-256, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST7.
    */
    __I  uint32_t SHA_DGST6;

    /**
     * SHA_DGST7
     * ===================================================================================================
     * Offset: 0x324  SHA Digest Message 7
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DGST      |SHA Digest Message Word
     * |        |          |For SHA-160, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST4.
     * |        |          |For SHA-224, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST6.
     * |        |          |For SHA-256, the digest is stored in CRPT_SHA_DGST0 ~ CRPT_SHA_DGST7.
    */
    __I  uint32_t SHA_DGST7;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE6[8];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * SHA_KEYCNT
     * ===================================================================================================
     * Offset: 0x348  SHA Key Byte Count Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEYCNT    |SHA Key Byte Count
     * |        |          |The CRPT_SHA_KEYCNT keeps the byte count of key that SHA engine operates.
     * |        |          |The register is 32-bit and the maximum byte count is 4G bytes.
     * |        |          |It can be read and written.
     * |        |          |Writing to the register CRPT_SHA_KEYCNT as the SHA accelerator operating doesn't affect the current SHA operation.
     * |        |          |But the value of SHA _KEY_CNT will be updated later on.
     * |        |          |Consequently, software can prepare the key count for the next SHA operation.
    */
    __IO uint32_t SHA_KEYCNT;

    /**
     * SHA_SADDR
     * ===================================================================================================
     * Offset: 0x34C  SHA DMA Source Address Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |SADDR     |SHA DMA Source Address
     * |        |          |The SHA accelerator supports DMA function to transfer the plain text between system memory and embedded FIFO.
     * |        |          |The CRPT_SHA_SADDR keeps the source address of the data buffer where the source text is stored.
     * |        |          |Based on the source address, the SHA accelerator can read the plain text from system memory and do SHA operation.
     * |        |          |The start of source address should be located at word boundary.
     * |        |          |In other words, bit 1 and 0 of CRPT_SHA_SADDR are ignored.
     * |        |          |CRPT_SHA_SADDR can be read and written.
     * |        |          |Writing to CRPT_SHA_SADDR while the SHA accelerator is operating doesn't affect the current SHA operation.
     * |        |          |But the value of CRPT_SHA_SADDR will be updated later on.
     * |        |          |Consequently, software can prepare the DMA source address for the next SHA operation.
     * |        |          |In DMA mode, software can update the next TDES_SADR before triggering START.
     * |        |          |TDES_SADR and TDES_DADR can be the same in the value.
    */
    __IO uint32_t SHA_SADDR;

    /**
     * SHA_DMACNT
     * ===================================================================================================
     * Offset: 0x350  SHA Byte Count Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DMACNT    |SHA Operation Byte Count
     * |        |          |The CRPT_SHA_DMACNT keeps the byte count of source text that is for the SHA engine operating in DMA mode.
     * |        |          |The CRPT_SHA_DMACNT is 32-bit and the maximum of byte count is 4G bytes.
     * |        |          |CRPT_SHA_DMACNT can be read and written.
     * |        |          |Writing to CRPT_SHA_DMACNT while the SHA accelerator is operating doesn't affect the current SHA operation.
     * |        |          |But the value of CRPT_SHA_DMACNT will be updated later on.
     * |        |          |Consequently, software can prepare the byte count of data for the next SHA operation.
     * |        |          |In Non-DMA mode, CRPT_SHA_DMACNT must be set as the byte count of the last block before feeding in the last block of data.
    */
    __IO uint32_t SHA_DMACNT;

    /**
     * SHA_DATIN
     * ===================================================================================================
     * Offset: 0x354  SHA Engine Non-DMA Mode Data Input Port Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |DATIN     |SHA Engine Input Port
     * |        |          |CPU feeds data to SHA engine through this port by checking CRPT_SHA_STS. Feed data as DATINREQ is 1.
    */
    __IO uint32_t SHA_DATIN;

} CRPT_T;

/**
    @addtogroup CRPT_CONST CRPT Bit Field Definition
    Constant Definitions for CRPT Controller
@{ */

