MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
#define CRPT_TDES1_DADDR_DADDR_Pos       (0)                                               /*!< CRPT_T::TDES1_DADDR: DADDR Position       */
#define CRPT_TDES1_DADDR_DADDR_Msk       (0xfffffffful << CRPT_TDES1_DADDR_DADDR_Pos)      /*!< CRPT_T::TDES1_DADDR: DADDR Mask           */

#define CRPT_TDES1_CNT_CNT_Pos           (0)                                               /*!< CRPT_T::TDES1_CNT: CNT Position           */
#define CRPT_TDES1_CNT_CNT_Msk           (0xfffffffful << CRPT_TDES1_CNT_CNT_Pos)          /*!< CRPT_T::TDES1_CNT: CNT Mask               */

#define CRPT_TDES2_KEY1H_KEY_Pos         (0)                                               /*!< CRPT_T::TDES2_KEY1H: KEY Position         */
#define CRPT_TDES2_KEY1H_KEY_Msk         (0xfffffffful << CRPT_TDES2_KEY1H_KEY_Pos)        /*!< CRPT_T::TDES2_KEY1H: KEY Mask             */

#define CRPT_TDES2_KEY1L_KEY_Pos         (0)                                               /*!< CRPT_T::TDES2_KEY1L: KEY Position         */
#define CRPT_TDES2_KEY1L_KEY_Msk         (0xfffffffful << CRPT_TDES2_KEY1L_KEY_Pos)        /*!< CRPT_T::TDES2_KEY1L: KEY Mask             */

#define CRPT_TDES2_KEY2H_KEY_Pos         (0)                                               /*!< CRPT_T::TDES2_KEY2H: KEY Position         */
#define CRPT_TDES2_KEY2H_KEY_Msk         (0xfffffffful << CRPT_TDES2_KEY2H_KEY_Pos)        /*!< CRPT_T::TDES2_KEY2H: KEY Mask             */

#define CRPT_TDES2_KEY2L_KEY_Pos         (0)                                               /*!< CRPT_T::TDES2_KEY2L: KEY Position         */
#define CRPT_TDES2_KEY2L_KEY_Msk         (0xfffffffful << CRPT_TDES2_KEY2L_KEY_Pos)        /*!< CRPT_T::TDES2_KEY2L: KEY Mask             */

#define CRPT_TDES2_KEY3H_KEY_Pos         (0)                                               /*!< CRPT_T::TDES2_KEY3H: KEY Position         */
#define CRPT_TDES2_KEY3H_KEY_Msk         (0xfffffffful << CRPT_TDES2_KEY3H_KEY_Pos)        /*!< CRPT_T::TDES2_KEY3H: KEY Mask             */

#define CRPT_TDES2_KEY3L_KEY_Pos         (0)                                               /*!< CRPT_T::TDES2_KEY3L: KEY Position         */
#define CRPT_TDES2_KEY3L_KEY_Msk         (0xfffffffful << CRPT_TDES2_KEY3L_KEY_Pos)        /*!< CRPT_T::TDES2_KEY3L: KEY Mask             */

#define CRPT_TDES2_IVH_IV_Pos            (0)                                               /*!< CRPT_T::TDES2_IVH: IV Position            */
#define CRPT_TDES2_IVH_IV_Msk            (0xfffffffful << CRPT_TDES2_IVH_IV_Pos)           /*!< CRPT_T::TDES2_IVH: IV Mask                */

#define CRPT_TDES2_IVL_IV_Pos            (0)                                               /*!< CRPT_T::TDES2_IVL: IV Position            */
#define CRPT_TDES2_IVL_IV_Msk            (0xfffffffful << CRPT_TDES2_IVL_IV_Pos)           /*!< CRPT_T::TDES2_IVL: IV Mask                */

#define CRPT_TDES2_SADDR_SADDR_Pos       (0)                                               /*!< CRPT_T::TDES2_SADDR: SADDR Position       */
#define CRPT_TDES2_SADDR_SADDR_Msk       (0xfffffffful << CRPT_TDES2_SADDR_SADDR_Pos)      /*!< CRPT_T::TDES2_SADDR: SADDR Mask           */

#define CRPT_TDES2_DADDR_DADDR_Pos       (0)                                               /*!< CRPT_T::TDES2_DADDR: DADDR Position       */
#define CRPT_TDES2_DADDR_DADDR_Msk       (0xfffffffful << CRPT_TDES2_DADDR_DADDR_Pos)      /*!< CRPT_T::TDES2_DADDR: DADDR Mask           */

#define CRPT_TDES2_CNT_CNT_Pos           (0)                                               /*!< CRPT_T::TDES2_CNT: CNT Position           */
#define CRPT_TDES2_CNT_CNT_Msk           (0xfffffffful << CRPT_TDES2_CNT_CNT_Pos)          /*!< CRPT_T::TDES2_CNT: CNT Mask               */

#define CRPT_TDES3_KEY1H_KEY_Pos         (0)                                               /*!< CRPT_T::TDES3_KEY1H: KEY Position         */
#define CRPT_TDES3_KEY1H_KEY_Msk         (0xfffffffful << CRPT_TDES3_KEY1H_KEY_Pos)        /*!< CRPT_T::TDES3_KEY1H: KEY Mask             */

#define CRPT_TDES3_KEY1L_KEY_Pos         (0)                                               /*!< CRPT_T::TDES3_KEY1L: KEY Position         */
#define CRPT_TDES3_KEY1L_KEY_Msk         (0xfffffffful << CRPT_TDES3_KEY1L_KEY_Pos)        /*!< CRPT_T::TDES3_KEY1L: KEY Mask             */

#define CRPT_TDES3_KEY2H_KEY_Pos         (0)                                               /*!< CRPT_T::TDES3_KEY2H: KEY Position         */
#define CRPT_TDES3_KEY2H_KEY_Msk         (0xfffffffful << CRPT_TDES3_KEY2H_KEY_Pos)        /*!< CRPT_T::TDES3_KEY2H: KEY Mask             */

#define CRPT_TDES3_KEY2L_KEY_Pos         (0)                                               /*!< CRPT_T::TDES3_KEY2L: KEY Position         */
#define CRPT_TDES3_KEY2L_KEY_Msk         (0xfffffffful << CRPT_TDES3_KEY2L_KEY_Pos)        /*!< CRPT_T::TDES3_KEY2L: KEY Mask             */

#define CRPT_TDES3_KEY3H_KEY_Pos         (0)                                               /*!< CRPT_T::TDES3_KEY3H: KEY Position         */
#define CRPT_TDES3_KEY3H_KEY_Msk         (0xfffffffful << CRPT_TDES3_KEY3H_KEY_Pos)        /*!< CRPT_T::TDES3_KEY3H: KEY Mask             */

#define CRPT_TDES3_KEY3L_KEY_Pos         (0)                                               /*!< CRPT_T::TDES3_KEY3L: KEY Position         */
#define CRPT_TDES3_KEY3L_KEY_Msk         (0xfffffffful << CRPT_TDES3_KEY3L_KEY_Pos)        /*!< CRPT_T::TDES3_KEY3L: KEY Mask             */

#define CRPT_TDES3_IVH_IV_Pos            (0)                                               /*!< CRPT_T::TDES3_IVH: IV Position            */
#define CRPT_TDES3_IVH_IV_Msk            (0xfffffffful << CRPT_TDES3_IVH_IV_Pos)           /*!< CRPT_T::TDES3_IVH: IV Mask                */

#define CRPT_TDES3_IVL_IV_Pos            (0)                                               /*!< CRPT_T::TDES3_IVL: IV Position            */
#define CRPT_TDES3_IVL_IV_Msk            (0xfffffffful << CRPT_TDES3_IVL_IV_Pos)           /*!< CRPT_T::TDES3_IVL: IV Mask                */

#define CRPT_TDES3_SADDR_SADDR_Pos       (0)                                               /*!< CRPT_T::TDES3_SADDR: SADDR Position       */
#define CRPT_TDES3_SADDR_SADDR_Msk       (0xfffffffful << CRPT_TDES3_SADDR_SADDR_Pos)      /*!< CRPT_T::TDES3_SADDR: SADDR Mask           */

#define CRPT_TDES3_DADDR_DADDR_Pos       (0)                                               /*!< CRPT_T::TDES3_DADDR: DADDR Position       */
#define CRPT_TDES3_DADDR_DADDR_Msk       (0xfffffffful << CRPT_TDES3_DADDR_DADDR_Pos)      /*!< CRPT_T::TDES3_DADDR: DADDR Mask           */

#define CRPT_TDES3_CNT_CNT_Pos           (0)                                               /*!< CRPT_T::TDES3_CNT: CNT Position           */
#define CRPT_TDES3_CNT_CNT_Msk           (0xfffffffful << CRPT_TDES3_CNT_CNT_Pos)          /*!< CRPT_T::TDES3_CNT: CNT Mask               */

#define CRPT_SHA_CTL_START_Pos           (0)                                               /*!< CRPT_T::SHA_CTL: START Position           */
#define CRPT_SHA_CTL_START_Msk           (0x1ul << CRPT_SHA_CTL_START_Pos)                 /*!< CRPT_T::SHA_CTL: START Mask               */

#define CRPT_SHA_CTL_STOP_Pos            (1)                                               /*!< CRPT_T::SHA_CTL: STOP Position            */
#define CRPT_SHA_CTL_STOP_Msk            (0x1ul << CRPT_SHA_CTL_STOP_Pos)                  /*!< CRPT_T::SHA_CTL: STOP Mask                */

#define CRPT_SHA_CTL_DMALAST_Pos         (5)                                               /*!< CRPT_T::SHA_CTL: DMALAST Position         */
#define CRPT_SHA_CTL_DMALAST_Msk         (0x1ul << CRPT_SHA_CTL_DMALAST_Pos)               /*!< CRPT_T::SHA_CTL: DMALAST Mask             */

#define CRPT_SHA_CTL_DMAEN_Pos           (7)                                               /*!< CRPT_T::SHA_CTL: DMAEN Position           */
#define CRPT_SHA_CTL_DMAEN_Msk           (0x1ul << CRPT_SHA_CTL_DMAEN_Pos)                 /*!< CRPT_T::SHA_CTL: DMAEN Mask               */

