MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
    /**
     * AD1DAT5
     * ===================================================================================================
     * Offset: 0x34  A/D Data Register 13 for SAMPLE15
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD1DAT5;

    /**
     * AD1DAT6
     * ===================================================================================================
     * Offset: 0x38  A/D Data Register 14 for SAMPLE16
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD1DAT6;

    /**
     * AD1DAT7
     * ===================================================================================================
     * Offset: 0x3C  A/D Data Register 15 for SAMPLE17
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:11]  |RESULT    |A/D Conversion Result
     * |        |          |This field contains 12 bits conversion result.
     * |[16]    |OV        |Overrun Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is recent conversion result.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is overwrite.
     * |        |          |If converted data in RESULT (EADC_ADnDATx[11:0]) has not been read before new conversion result is loaded to this register, OV (EADC_ADnDATx[16]) is set to 1.
     * |        |          |It is cleared by hardware after EADC_ADnDATx register is read.
     * |[17]    |VALID     |Valid Flag
     * |        |          |0 = Data in RESULT (EADC_ADnDATx[11:0]) is not valid.
     * |        |          |1 = Data in RESULT (EADC_ADnDATx[11:0]) is valid.
     * |        |          |This bit is set to 1 when corresponding SAMPLE channel analog input conversion is completed and cleared by hardware after EADC_ADnDATx register is read.
    */
    __I  uint32_t AD1DAT7;

    /**
     * CTL
     * ===================================================================================================
     * Offset: 0x40  A/D Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADCEN     |A/D Converter Enable Control
     * |        |          |0 = Disabled.
     * |        |          |1 = Enabled.
     * |        |          |Before starting A/D conversion function, this bit should be set to 1.
     * |        |          |Clear it to 0 to disable A/D converter analog circuit power consumption.
     * |[1]     |ADCRST    |ADC0, ADC1 A/D Converter Control Circuits Reset
     * |        |          |0 = No effect.
     * |        |          |1 = Cause ADC control circuits reset to initial state, but not change the ADC registers value.
     * |        |          |The ADCRST (EADC_CTL [1]) bit remains 1 during ADC reset, when ADC reset end, the ADCRST (EADC_CTL [1]) bit is automatically cleared to 0.
     * |[2]     |ADCIEN0   |Specific SAMPLE A/D ADINT0 Interrupt Enable Control
     * |        |          |0 = Specific SAMPLE A/D ADINT0 interrupt function Disabled.
     * |        |          |1 = Specific SAMPLE A/D ADINT0 interrupt function Enabled.
     * |        |          |The A/D converter generates a conversion end ADIF0 (EADC_STATUS1 [0]) flag upon the end of specific SAMPLE A/D conversion.
     * |        |          |If ADCIEN0 (EADC_CTL [2]) bit is set then conversion end interrupt request ADINT0 is generated.
     * |[3]     |ADCIEN1   |Specific SAMPLE A/D ADINT1 Interrupt Enable Control
     * |        |          |0 = Specific SAMPLE A/D ADINT1 interrupt function Disabled.
     * |        |          |1 = Specific SAMPLE A/D ADINT1 interrupt function Enabled.
     * |        |          |The A/D converter generates a conversion end ADIF0 (EADC_STATUS1 [1]) flag upon the end of specific SAMPLE A/D conversion.
     * |        |          |If ADCIEN1 EADC_CTL [3]) bit is set then conversion end interrupt request ADINT1 is generated.
     * |[4]     |ADCIEN2   |Specific SAMPLE A/D ADINT2 Interrupt Enable Control
     * |        |          |0 = Specific SAMPLE A/D ADINT2 interrupt function Disabled.
     * |        |          |1 = Specific SAMPLE A/D ADINT2 interrupt function Enabled.
     * |        |          |The A/D converter generates a conversion end ADIF2 (EADC_STATUS1 [2]) flag upon the end of specific SAMPLE A/D conversion.
     * |        |          |If ADCIEN2 (EADC_CTL [4]) bit is set then conversion end interrupt request ADINT2 is generated.
     * |[5]     |ADCIEN3   |Specific SAMPLE A/D ADINT3 Interrupt Enable Control
     * |        |          |0 = Specific SAMPLE A/D ADINT3 interrupt function Disabled.
     * |        |          |1 = Specific SAMPLE A/D ADINT3 interrupt function Enabled.
     * |        |          |The A/D converter generates a conversion end ADIF3 (EADC_STATUS1 [3]) flag upon the end of specific SAMPLE A/D conversion.
     * |        |          |If ADCIEN3 (EADC_CTL [5]) bit is set then conversion end interrupt request ADINT3 is generated.
    */
    __IO uint32_t CTL;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE0[1];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * SWTRG
     * ===================================================================================================
     * Offset: 0x48  A/D SAMPLE Software Start Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |SWTRG7_0  |A/D SAMPLE07~SAMPLE00 Software Force To Start ADC Conversion
     * |        |          |0 = No effect.
     * |        |          |1 = Start an ADC conversion when the priority is given to SAMPLE0x.
     * |        |          |Note: x = 0~7.
     * |[8:15]  |SWTRG15_8 |A/D SAMPLE17~SAMPLE10 Software Force To Start ADC Conversion
     * |        |          |0 = No effect.
     * |        |          |1 = Start an ADC conversion when the priority is given to SAMPLE1x.
     * |        |          |Note: x = 0~7.
    */
    __O  uint32_t SWTRG;

    /**
     * PENDSTS
     * ===================================================================================================
     * Offset: 0x4C  A/D Start of Conversion Pending Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |STPF7_0   |A/D SAMPLE07~SAMPLE00 Start Of Conversion Pending Flag
     * |        |          |0 = There is no pending conversion for SAMPLE0x.
     * |        |          |1 = SAMPLE0x ADC start of conversion is pending.
     * |        |          |Note: This bit remains 1 during pending state, when the respective ADC conversion is started, the STPF bit is automatically cleared to 0.
     * |        |          |Note: x = 0~7.
     * |[8:15]  |STPF15_8  |A/D SAMPLE17~SAMPLE10 Start Of Conversion Pending Flag
     * |        |          |0 = There is no pending conversion for SAMPLE1x.
     * |        |          |1 = SAMPLE1x ADC start of conversion is pending.
     * |        |          |Note: This bit remains 1 during pending state, when the respective ADC conversion is started, the STPF bit is automatically cleared to 0.
     * |        |          |Note: x = 0~7.
    */
    __I  uint32_t PENDSTS;

    /**
     * ADIFOV
     * ===================================================================================================
     * Offset: 0x50  A/D ADINT3~0 Interrupt Flag Overrun Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ADFOV0    |A/D ADINT0 Interrupt Flag Overrun
     * |        |          |0 = ADINT0 interrupt flag is not overwritten to 1.
     * |        |          |1 = ADINT0 interrupt flag is overwritten to 1.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |[1]     |ADFOV1    |A/D ADINT1 Interrupt Flag Overrun
     * |        |          |0 = ADINT1 interrupt flag is not overwritten to 1.
     * |        |          |1 = ADINT1 interrupt flag is overwritten to 1.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |[2]     |ADFOV2    |A/D ADINT2 Interrupt Flag Overrun
     * |        |          |0 = ADINT2 interrupt flag is not overwritten to 1.
     * |        |          |1 = ADINT2 interrupt flag is overwritten to 1.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |[3]     |ADFOV3    |A/D ADINT3 Interrupt Flag Overrun
     * |        |          |0 = ADINT3 interrupt flag is not overwritten to 1.
     * |        |          |1 = ADINT3 interrupt flag is overwritten to 1.
     * |        |          |Note: This bit is cleared by writing 1 to it.
    */
    __IO uint32_t ADIFOV;

    /**
     * OVSTS
     * ===================================================================================================
     * Offset: 0x54  A/D SAMPLE Start of Conversion Overrun Flag Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:7]   |SPOVF7_0  |A/D SAMPLE07~SAMPLE00 Start Of Conversion Overrun Flag
     * |        |          |0 = No SAMPLE0x event overrun.
     * |        |          |1 = Indicates a new SAMPLE0x event is generated while an old one event is pending.
     * |        |          |If there is a new trigger event comes when the SAMPLE is pending for the last trigger event, the overrun is happened and the SPOVF bit will be set as 1.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |        |          |Note: x = 0~7.
     * |[8:15]  |SPOVF15_8 |A/D SAMPLE17~SAMPLE10 Start Of Conversion Overrun Flag
     * |        |          |0 = No SAMPLE1x event overrun.
     * |        |          |1 = Indicates a new SAMPLE1x event is generated while an old one event is pending.
     * |        |          |If there is a new trigger event comes when the SAMPLE is pending for the last trigger event, the overrun is happened and the SPOVF bit will be set as 1.
     * |        |          |Note: This bit is cleared by writing 1 to it.
     * |        |          |Note: x = 0~7.
    */
    __IO uint32_t OVSTS;

    /**
     * AD0SPCTL0
     * ===================================================================================================
     * Offset: 0x58  A/D SAMPLE00 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |CHSEL     |A/D SAMPLE0,1 Channel Selection
     * |        |          |0000 = ADCn_CH0.
     * |        |          |0001 = ADCn_CH1.
     * |        |          |0010 = ADCn_CH2.
     * |        |          |0011 = ADCn_CH3.
     * |        |          |0100 = ADCn_CH4.
     * |        |          |0101 = ADCn_CH5.
     * |        |          |0110 = ADCn_CH6.
     * |        |          |0111 = ADCn_CH7.
     * |        |          |For SAMPLE0
     * |        |          |1000 = VBG.
     * |        |          |1001 = VTEMP.
     * |        |          |1010 = AVSS.
     * |        |          |1011 = OP0.
     * |        |          |For SAMPLE1
     * |        |          |1000= OP1.
     * |[4:7]   |TRGSEL    |A/D SAMPLE Start Of Conversion Trigger Source Selection
     * |        |          |0000 = Disable hardware trigger.
     * |        |          |0001 = External pin (STADC) trigger.
     * |        |          |0010 = ADC ADINT0 interrupt EOC pulse trigger.
     * |        |          |0011 = ADC ADINT1 interrupt EOC pulse trigger.
     * |        |          |0100 = Timer0 overflow pulse trigger.
     * |        |          |0101 = Timer1 overflow pulse trigger.
     * |        |          |0110 = Timer2 overflow pulse trigger.
     * |        |          |0111 = Timer3 overflow pulse trigger.
     * |        |          |1000 = EPWM0_CH0 trigger.
     * |        |          |1001 = EPWM0_CH2 trigger.
     * |        |          |1010 = EPWM0_CH4 trigger.
     * |        |          |1011 = EPWM1_CH0 trigger.
     * |        |          |1100 = EPWM1_CH2 trigger.
     * |        |          |1101 = EPWM1_CH4 trigger.
     * |        |          |1110 = PWM0_CH0 trigger.
     * |        |          |1111 = PWM0_CH1 trigger.
     * |[8:15]  |TRGDLYCNT |A/D SAMPLE Start Of Conversion Trigger Delay Time
     * |        |          |Trigger delay time = (TRGDLYCNT + 4) x Trigger delay clock period.
     * |[16:17] |TRGDLYDIV |A/D SAMPLE Start Of Conversion Trigger Delay Clock Divider Selection
     * |        |          |Trigger delay clock frequency:
     * |        |          |00 = ADC_CLK/1.
     * |        |          |01 = ADC_CLK/2.
     * |        |          |10 = ADC_CLK/4.
     * |        |          |11 = ADC_CLK/16.
     * |[20]    |EXTREN    |A/D External Pin Rising Edge Trigger Enable Control
     * |        |          |0 = A/D external pin rising edge trigger Disabled.
     * |        |          |1 = A/D external pin rising edge trigger Enabled.
     * |[21]    |EXTFEN    |A/D External Pin Falling Edge Trigger Enable Control
     * |        |          |0 = A/D external pin falling edge trigger Disabled.
     * |        |          |1 = A/D external pin falling edge trigger Enabled.
    */
    __IO uint32_t AD0SPCTL0;

    /**
     * AD0SPCTL1
     * ===================================================================================================
     * Offset: 0x5C  A/D SAMPLE01 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |CHSEL     |A/D SAMPLE0,1 Channel Selection
     * |        |          |0000 = ADCn_CH0.
     * |        |          |0001 = ADCn_CH1.
     * |        |          |0010 = ADCn_CH2.
     * |        |          |0011 = ADCn_CH3.
     * |        |          |0100 = ADCn_CH4.
     * |        |          |0101 = ADCn_CH5.
     * |        |          |0110 = ADCn_CH6.
     * |        |          |0111 = ADCn_CH7.
     * |        |          |For SAMPLE0
     * |        |          |1000 = VBG.
     * |        |          |1001 = VTEMP.
     * |        |          |1010 = AVSS.
     * |        |          |1011 = OP0.
     * |        |          |For SAMPLE1
     * |        |          |1000= OP1.
     * |[4:7]   |TRGSEL    |A/D SAMPLE Start Of Conversion Trigger Source Selection
     * |        |          |0000 = Disable hardware trigger.
     * |        |          |0001 = External pin (STADC) trigger.
     * |        |          |0010 = ADC ADINT0 interrupt EOC pulse trigger.
     * |        |          |0011 = ADC ADINT1 interrupt EOC pulse trigger.
     * |        |          |0100 = Timer0 overflow pulse trigger.
     * |        |          |0101 = Timer1 overflow pulse trigger.
     * |        |          |0110 = Timer2 overflow pulse trigger.
     * |        |          |0111 = Timer3 overflow pulse trigger.
     * |        |          |1000 = EPWM0_CH0 trigger.
     * |        |          |1001 = EPWM0_CH2 trigger.
     * |        |          |1010 = EPWM0_CH4 trigger.
     * |        |          |1011 = EPWM1_CH0 trigger.
     * |        |          |1100 = EPWM1_CH2 trigger.
     * |        |          |1101 = EPWM1_CH4 trigger.
     * |        |          |1110 = PWM0_CH0 trigger.
     * |        |          |1111 = PWM0_CH1 trigger.
     * |[8:15]  |TRGDLYCNT |A/D SAMPLE Start Of Conversion Trigger Delay Time
     * |        |          |Trigger delay time = (TRGDLYCNT + 4) x Trigger delay clock period.
     * |[16:17] |TRGDLYDIV |A/D SAMPLE Start Of Conversion Trigger Delay Clock Divider Selection
     * |        |          |Trigger delay clock frequency:
     * |        |          |00 = ADC_CLK/1.
     * |        |          |01 = ADC_CLK/2.
     * |        |          |10 = ADC_CLK/4.
     * |        |          |11 = ADC_CLK/16.
     * |[20]    |EXTREN    |A/D External Pin Rising Edge Trigger Enable Control
     * |        |          |0 = A/D external pin rising edge trigger Disabled.
     * |        |          |1 = A/D external pin rising edge trigger Enabled.
     * |[21]    |EXTFEN    |A/D External Pin Falling Edge Trigger Enable Control
     * |        |          |0 = A/D external pin falling edge trigger Disabled.
     * |        |          |1 = A/D external pin falling edge trigger Enabled.
    */
    __IO uint32_t AD0SPCTL1;

    /**
     * AD0SPCTL2
     * ===================================================================================================
     * Offset: 0x60  A/D SAMPLE02 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |CHSEL     |A/D SAMPLE0,1 Channel Selection
     * |        |          |0000 = ADCn_CH0.
     * |        |          |0001 = ADCn_CH1.
     * |        |          |0010 = ADCn_CH2.
     * |        |          |0011 = ADCn_CH3.
     * |        |          |0100 = ADCn_CH4.
     * |        |          |0101 = ADCn_CH5.
     * |        |          |0110 = ADCn_CH6.
     * |        |          |0111 = ADCn_CH7.
     * |        |          |For SAMPLE0
     * |        |          |1000 = VBG.
     * |        |          |1001 = VTEMP.
     * |        |          |1010 = AVSS.
     * |        |          |1011 = OP0.
     * |        |          |For SAMPLE1
     * |        |          |1000= OP1.
     * |[4:7]   |TRGSEL    |A/D SAMPLE Start Of Conversion Trigger Source Selection
     * |        |          |0000 = Disable hardware trigger.
     * |        |          |0001 = External pin (STADC) trigger.
     * |        |          |0010 = ADC ADINT0 interrupt EOC pulse trigger.
     * |        |          |0011 = ADC ADINT1 interrupt EOC pulse trigger.
     * |        |          |0100 = Timer0 overflow pulse trigger.
     * |        |          |0101 = Timer1 overflow pulse trigger.
     * |        |          |0110 = Timer2 overflow pulse trigger.
     * |        |          |0111 = Timer3 overflow pulse trigger.
     * |        |          |1000 = EPWM0_CH0 trigger.
     * |        |          |1001 = EPWM0_CH2 trigger.
     * |        |          |1010 = EPWM0_CH4 trigger.
     * |        |          |1011 = EPWM1_CH0 trigger.
     * |        |          |1100 = EPWM1_CH2 trigger.
     * |        |          |1101 = EPWM1_CH4 trigger.
     * |        |          |1110 = PWM0_CH0 trigger.
     * |        |          |1111 = PWM0_CH1 trigger.
     * |[8:15]  |TRGDLYCNT |A/D SAMPLE Start Of Conversion Trigger Delay Time
     * |        |          |Trigger delay time = (TRGDLYCNT + 4) x Trigger delay clock period.
     * |[16:17] |TRGDLYDIV |A/D SAMPLE Start Of Conversion Trigger Delay Clock Divider Selection
     * |        |          |Trigger delay clock frequency:
     * |        |          |00 = ADC_CLK/1.
     * |        |          |01 = ADC_CLK/2.
     * |        |          |10 = ADC_CLK/4.
     * |        |          |11 = ADC_CLK/16.
     * |[20]    |EXTREN    |A/D External Pin Rising Edge Trigger Enable Control
     * |        |          |0 = A/D external pin rising edge trigger Disabled.
     * |        |          |1 = A/D external pin rising edge trigger Enabled.
     * |[21]    |EXTFEN    |A/D External Pin Falling Edge Trigger Enable Control
     * |        |          |0 = A/D external pin falling edge trigger Disabled.
     * |        |          |1 = A/D external pin falling edge trigger Enabled.
    */
    __IO uint32_t AD0SPCTL2;

