MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
    /**
     * AD0SPCTL3
     * ===================================================================================================
     * Offset: 0x64  A/D SAMPLE03 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |CHSEL     |A/D SAMPLE0,1 Channel Selection
     * |        |          |0000 = ADCn_CH0.
     * |        |          |0001 = ADCn_CH1.
     * |        |          |0010 = ADCn_CH2.
     * |        |          |0011 = ADCn_CH3.
     * |        |          |0100 = ADCn_CH4.
     * |        |          |0101 = ADCn_CH5.
     * |        |          |0110 = ADCn_CH6.
     * |        |          |0111 = ADCn_CH7.
     * |        |          |For SAMPLE0
     * |        |          |1000 = VBG.
     * |        |          |1001 = VTEMP.
     * |        |          |1010 = AVSS.
     * |        |          |1011 = OP0.
     * |        |          |For SAMPLE1
     * |        |          |1000= OP1.
     * |[4:7]   |TRGSEL    |A/D SAMPLE Start Of Conversion Trigger Source Selection
     * |        |          |0000 = Disable hardware trigger.
     * |        |          |0001 = External pin (STADC) trigger.
     * |        |          |0010 = ADC ADINT0 interrupt EOC pulse trigger.
     * |        |          |0011 = ADC ADINT1 interrupt EOC pulse trigger.
     * |        |          |0100 = Timer0 overflow pulse trigger.
     * |        |          |0101 = Timer1 overflow pulse trigger.
     * |        |          |0110 = Timer2 overflow pulse trigger.
     * |        |          |0111 = Timer3 overflow pulse trigger.
     * |        |          |1000 = EPWM0_CH0 trigger.
     * |        |          |1001 = EPWM0_CH2 trigger.
     * |        |          |1010 = EPWM0_CH4 trigger.
     * |        |          |1011 = EPWM1_CH0 trigger.
     * |        |          |1100 = EPWM1_CH2 trigger.
     * |        |          |1101 = EPWM1_CH4 trigger.
     * |        |          |1110 = PWM0_CH0 trigger.
     * |        |          |1111 = PWM0_CH1 trigger.
     * |[8:15]  |TRGDLYCNT |A/D SAMPLE Start Of Conversion Trigger Delay Time
     * |        |          |Trigger delay time = (TRGDLYCNT + 4) x Trigger delay clock period.
     * |[16:17] |TRGDLYDIV |A/D SAMPLE Start Of Conversion Trigger Delay Clock Divider Selection
     * |        |          |Trigger delay clock frequency:
     * |        |          |00 = ADC_CLK/1.
     * |        |          |01 = ADC_CLK/2.
     * |        |          |10 = ADC_CLK/4.
     * |        |          |11 = ADC_CLK/16.
     * |[20]    |EXTREN    |A/D External Pin Rising Edge Trigger Enable Control
     * |        |          |0 = A/D external pin rising edge trigger Disabled.
     * |        |          |1 = A/D external pin rising edge trigger Enabled.
     * |[21]    |EXTFEN    |A/D External Pin Falling Edge Trigger Enable Control
     * |        |          |0 = A/D external pin falling edge trigger Disabled.
     * |        |          |1 = A/D external pin falling edge trigger Enabled.
    */
    __IO uint32_t AD0SPCTL3;

    /**
     * AD0SPCTL4
     * ===================================================================================================
     * Offset: 0x68  A/D SAMPLE04 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |CHSEL     |A/D SAMPLE0,1 Channel Selection
     * |        |          |0000 = ADCn_CH0.
     * |        |          |0001 = ADCn_CH1.
     * |        |          |0010 = ADCn_CH2.
     * |        |          |0011 = ADCn_CH3.
     * |        |          |0100 = ADCn_CH4.
     * |        |          |0101 = ADCn_CH5.
     * |        |          |0110 = ADCn_CH6.
     * |        |          |0111 = ADCn_CH7.
     * |        |          |For SAMPLE0
     * |        |          |1000 = VBG.
     * |        |          |1001 = VTEMP.
     * |        |          |1010 = AVSS.
     * |        |          |1011 = OP0.
     * |        |          |For SAMPLE1
     * |        |          |1000= OP1.
     * |[4:6]   |TRGSEL    |A/D SAMPLE Start Of Conversion Trigger Source Selection
     * |        |          |000 = Disable hardware trigger.
     * |        |          |001 = External pin (STADC) trigger.
     * |        |          |010 = ADC ADINT0 interrupt EOC pulse trigger.
     * |        |          |011 = ADC ADINT1 interrupt EOC pulse trigger.
     * |        |          |100 = Timer0 overflow pulse trigger.
     * |        |          |101 = Timer1 overflow pulse trigger.
     * |        |          |110 = Timer2 overflow pulse trigger.
     * |        |          |111 = Timer3 overflow pulse trigger.
     * |[20]    |EXTREN    |A/D External Pin Rising Edge Trigger Enable Control
     * |        |          |0 = A/D external pin rising edge trigger Disabled.
     * |        |          |1 = A/D external pin rising edge trigger Enabled.
     * |[21]    |EXTFEN    |A/D External Pin Falling Edge Trigger Enable Control
     * |        |          |0 = A/D external pin falling edge trigger Disabled.
     * |        |          |1 = A/D external pin falling edge trigger Enabled.
    */
    __IO uint32_t AD0SPCTL4;

    /**
     * AD0SPCTL5
     * ===================================================================================================
     * Offset: 0x6C  A/D SAMPLE05 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |CHSEL     |A/D SAMPLE0,1 Channel Selection
     * |        |          |0000 = ADCn_CH0.
     * |        |          |0001 = ADCn_CH1.
     * |        |          |0010 = ADCn_CH2.
     * |        |          |0011 = ADCn_CH3.
     * |        |          |0100 = ADCn_CH4.
     * |        |          |0101 = ADCn_CH5.
     * |        |          |0110 = ADCn_CH6.
     * |        |          |0111 = ADCn_CH7.
     * |        |          |For SAMPLE0
     * |        |          |1000 = VBG.
     * |        |          |1001 = VTEMP.
     * |        |          |1010 = AVSS.
     * |        |          |1011 = OP0.
     * |        |          |For SAMPLE1
     * |        |          |1000= OP1.
     * |[4:6]   |TRGSEL    |A/D SAMPLE Start Of Conversion Trigger Source Selection
     * |        |          |000 = Disable hardware trigger.
     * |        |          |001 = External pin (STADC) trigger.
     * |        |          |010 = ADC ADINT0 interrupt EOC pulse trigger.
     * |        |          |011 = ADC ADINT1 interrupt EOC pulse trigger.
     * |        |          |100 = Timer0 overflow pulse trigger.
     * |        |          |101 = Timer1 overflow pulse trigger.
     * |        |          |110 = Timer2 overflow pulse trigger.
     * |        |          |111 = Timer3 overflow pulse trigger.
     * |[20]    |EXTREN    |A/D External Pin Rising Edge Trigger Enable Control
     * |        |          |0 = A/D external pin rising edge trigger Disabled.
     * |        |          |1 = A/D external pin rising edge trigger Enabled.
     * |[21]    |EXTFEN    |A/D External Pin Falling Edge Trigger Enable Control
     * |        |          |0 = A/D external pin falling edge trigger Disabled.
     * |        |          |1 = A/D external pin falling edge trigger Enabled.
    */
    __IO uint32_t AD0SPCTL5;

    /**
     * AD0SPCTL6
     * ===================================================================================================
     * Offset: 0x70  A/D SAMPLE06 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |CHSEL     |A/D SAMPLE0,1 Channel Selection
     * |        |          |0000 = ADCn_CH0.
     * |        |          |0001 = ADCn_CH1.
     * |        |          |0010 = ADCn_CH2.
     * |        |          |0011 = ADCn_CH3.
     * |        |          |0100 = ADCn_CH4.
     * |        |          |0101 = ADCn_CH5.
     * |        |          |0110 = ADCn_CH6.
     * |        |          |0111 = ADCn_CH7.
     * |        |          |For SAMPLE0
     * |        |          |1000 = VBG.
     * |        |          |1001 = VTEMP.
     * |        |          |1010 = AVSS.
     * |        |          |1011 = OP0.
     * |        |          |For SAMPLE1
     * |        |          |1000= OP1.
     * |[4:6]   |TRGSEL    |A/D SAMPLE Start Of Conversion Trigger Source Selection
     * |        |          |000 = Disable hardware trigger.
     * |        |          |001 = External pin (STADC) trigger.
     * |        |          |010 = ADC ADINT0 interrupt EOC pulse trigger.
     * |        |          |011 = ADC ADINT1 interrupt EOC pulse trigger.
     * |        |          |100 = Timer0 overflow pulse trigger.
     * |        |          |101 = Timer1 overflow pulse trigger.
     * |        |          |110 = Timer2 overflow pulse trigger.
     * |        |          |111 = Timer3 overflow pulse trigger.
     * |[20]    |EXTREN    |A/D External Pin Rising Edge Trigger Enable Control
     * |        |          |0 = A/D external pin rising edge trigger Disabled.
     * |        |          |1 = A/D external pin rising edge trigger Enabled.
     * |[21]    |EXTFEN    |A/D External Pin Falling Edge Trigger Enable Control
     * |        |          |0 = A/D external pin falling edge trigger Disabled.
     * |        |          |1 = A/D external pin falling edge trigger Enabled.
    */
    __IO uint32_t AD0SPCTL6;

    /**
     * AD0SPCTL7
     * ===================================================================================================
     * Offset: 0x74  A/D SAMPLE07 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |CHSEL     |A/D SAMPLE0,1 Channel Selection
     * |        |          |0000 = ADCn_CH0.
     * |        |          |0001 = ADCn_CH1.
     * |        |          |0010 = ADCn_CH2.
     * |        |          |0011 = ADCn_CH3.
     * |        |          |0100 = ADCn_CH4.
     * |        |          |0101 = ADCn_CH5.
     * |        |          |0110 = ADCn_CH6.
     * |        |          |0111 = ADCn_CH7.
     * |        |          |For SAMPLE0
     * |        |          |1000 = VBG.
     * |        |          |1001 = VTEMP.
     * |        |          |1010 = AVSS.
     * |        |          |1011 = OP0.
     * |        |          |For SAMPLE1
     * |        |          |1000= OP1.
     * |[4:6]   |TRGSEL    |A/D SAMPLE Start Of Conversion Trigger Source Selection
     * |        |          |000 = Disable hardware trigger.
     * |        |          |001 = External pin (STADC) trigger.
     * |        |          |010 = ADC ADINT0 interrupt EOC pulse trigger.
     * |        |          |011 = ADC ADINT1 interrupt EOC pulse trigger.
     * |        |          |100 = Timer0 overflow pulse trigger.
     * |        |          |101 = Timer1 overflow pulse trigger.
     * |        |          |110 = Timer2 overflow pulse trigger.
     * |        |          |111 = Timer3 overflow pulse trigger.
     * |[20]    |EXTREN    |A/D External Pin Rising Edge Trigger Enable Control
     * |        |          |0 = A/D external pin rising edge trigger Disabled.
     * |        |          |1 = A/D external pin rising edge trigger Enabled.
     * |[21]    |EXTFEN    |A/D External Pin Falling Edge Trigger Enable Control
     * |        |          |0 = A/D external pin falling edge trigger Disabled.
     * |        |          |1 = A/D external pin falling edge trigger Enabled.
    */
    __IO uint32_t AD0SPCTL7;

    /**
     * AD1SPCTL0
     * ===================================================================================================
     * Offset: 0x78  A/D SAMPLE10 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |CHSEL     |A/D SAMPLE0,1 Channel Selection
     * |        |          |0000 = ADCn_CH0.
     * |        |          |0001 = ADCn_CH1.
     * |        |          |0010 = ADCn_CH2.
     * |        |          |0011 = ADCn_CH3.
     * |        |          |0100 = ADCn_CH4.
     * |        |          |0101 = ADCn_CH5.
     * |        |          |0110 = ADCn_CH6.
     * |        |          |0111 = ADCn_CH7.
     * |        |          |For SAMPLE0
     * |        |          |1000 = VBG.
     * |        |          |1001 = VTEMP.
     * |        |          |1010 = AVSS.
     * |        |          |1011 = OP0.
     * |        |          |For SAMPLE1
     * |        |          |1000= OP1.
     * |[4:7]   |TRGSEL    |A/D SAMPLE Start Of Conversion Trigger Source Selection
     * |        |          |0000 = Disable hardware trigger.
     * |        |          |0001 = External pin (STADC) trigger.
     * |        |          |0010 = ADC ADINT0 interrupt EOC pulse trigger.
     * |        |          |0011 = ADC ADINT1 interrupt EOC pulse trigger.
     * |        |          |0100 = Timer0 overflow pulse trigger.
     * |        |          |0101 = Timer1 overflow pulse trigger.
     * |        |          |0110 = Timer2 overflow pulse trigger.
     * |        |          |0111 = Timer3 overflow pulse trigger.
     * |        |          |1000 = EPWM0_CH0 trigger.
     * |        |          |1001 = EPWM0_CH2 trigger.
     * |        |          |1010 = EPWM0_CH4 trigger.
     * |        |          |1011 = EPWM1_CH0 trigger.
     * |        |          |1100 = EPWM1_CH2 trigger.
     * |        |          |1101 = EPWM1_CH4 trigger.
     * |        |          |1110 = PWM0_CH0 trigger.
     * |        |          |1111 = PWM0_CH1 trigger.
     * |[8:15]  |TRGDLYCNT |A/D SAMPLE Start Of Conversion Trigger Delay Time
     * |        |          |Trigger delay time = (TRGDLYCNT + 4) x Trigger delay clock period.
     * |[16:17] |TRGDLYDIV |A/D SAMPLE Start Of Conversion Trigger Delay Clock Divider Selection
     * |        |          |Trigger delay clock frequency:
     * |        |          |00 = ADC_CLK/1.
     * |        |          |01 = ADC_CLK/2.
     * |        |          |10 = ADC_CLK/4.
     * |        |          |11 = ADC_CLK/16.
     * |[20]    |EXTREN    |A/D External Pin Rising Edge Trigger Enable Control
     * |        |          |0 = A/D external pin rising edge trigger Disabled.
     * |        |          |1 = A/D external pin rising edge trigger Enabled.
     * |[21]    |EXTFEN    |A/D External Pin Falling Edge Trigger Enable Control
     * |        |          |0 = A/D external pin falling edge trigger Disabled.
     * |        |          |1 = A/D external pin falling edge trigger Enabled.
    */
    __IO uint32_t AD1SPCTL0;

    /**
     * AD1SPCTL1
     * ===================================================================================================
     * Offset: 0x7C  A/D SAMPLE11 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |CHSEL     |A/D SAMPLE0,1 Channel Selection
     * |        |          |0000 = ADCn_CH0.
     * |        |          |0001 = ADCn_CH1.
     * |        |          |0010 = ADCn_CH2.
     * |        |          |0011 = ADCn_CH3.
     * |        |          |0100 = ADCn_CH4.
     * |        |          |0101 = ADCn_CH5.
     * |        |          |0110 = ADCn_CH6.
     * |        |          |0111 = ADCn_CH7.
     * |        |          |For SAMPLE0
     * |        |          |1000 = VBG.
     * |        |          |1001 = VTEMP.
     * |        |          |1010 = AVSS.
     * |        |          |1011 = OP0.
     * |        |          |For SAMPLE1
     * |        |          |1000= OP1.
     * |[4:7]   |TRGSEL    |A/D SAMPLE Start Of Conversion Trigger Source Selection
     * |        |          |0000 = Disable hardware trigger.
     * |        |          |0001 = External pin (STADC) trigger.
     * |        |          |0010 = ADC ADINT0 interrupt EOC pulse trigger.
     * |        |          |0011 = ADC ADINT1 interrupt EOC pulse trigger.
     * |        |          |0100 = Timer0 overflow pulse trigger.
     * |        |          |0101 = Timer1 overflow pulse trigger.
     * |        |          |0110 = Timer2 overflow pulse trigger.
     * |        |          |0111 = Timer3 overflow pulse trigger.
     * |        |          |1000 = EPWM0_CH0 trigger.
     * |        |          |1001 = EPWM0_CH2 trigger.
     * |        |          |1010 = EPWM0_CH4 trigger.
     * |        |          |1011 = EPWM1_CH0 trigger.
     * |        |          |1100 = EPWM1_CH2 trigger.
     * |        |          |1101 = EPWM1_CH4 trigger.
     * |        |          |1110 = PWM0_CH0 trigger.
     * |        |          |1111 = PWM0_CH1 trigger.
     * |[8:15]  |TRGDLYCNT |A/D SAMPLE Start Of Conversion Trigger Delay Time
     * |        |          |Trigger delay time = (TRGDLYCNT + 4) x Trigger delay clock period.
     * |[16:17] |TRGDLYDIV |A/D SAMPLE Start Of Conversion Trigger Delay Clock Divider Selection
     * |        |          |Trigger delay clock frequency:
     * |        |          |00 = ADC_CLK/1.
     * |        |          |01 = ADC_CLK/2.
     * |        |          |10 = ADC_CLK/4.
     * |        |          |11 = ADC_CLK/16.
     * |[20]    |EXTREN    |A/D External Pin Rising Edge Trigger Enable Control
     * |        |          |0 = A/D external pin rising edge trigger Disabled.
     * |        |          |1 = A/D external pin rising edge trigger Enabled.
     * |[21]    |EXTFEN    |A/D External Pin Falling Edge Trigger Enable Control
     * |        |          |0 = A/D external pin falling edge trigger Disabled.
     * |        |          |1 = A/D external pin falling edge trigger Enabled.
    */
    __IO uint32_t AD1SPCTL1;

    /**
     * AD1SPCTL2
     * ===================================================================================================
     * Offset: 0x80  A/D SAMPLE12 Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |CHSEL     |A/D SAMPLE0,1 Channel Selection
     * |        |          |0000 = ADCn_CH0.
     * |        |          |0001 = ADCn_CH1.
     * |        |          |0010 = ADCn_CH2.
     * |        |          |0011 = ADCn_CH3.
     * |        |          |0100 = ADCn_CH4.
     * |        |          |0101 = ADCn_CH5.
     * |        |          |0110 = ADCn_CH6.
     * |        |          |0111 = ADCn_CH7.
     * |        |          |For SAMPLE0
     * |        |          |1000 = VBG.
     * |        |          |1001 = VTEMP.
     * |        |          |1010 = AVSS.
     * |        |          |1011 = OP0.
     * |        |          |For SAMPLE1
     * |        |          |1000= OP1.
     * |[4:7]   |TRGSEL    |A/D SAMPLE Start Of Conversion Trigger Source Selection
     * |        |          |0000 = Disable hardware trigger.
     * |        |          |0001 = External pin (STADC) trigger.
     * |        |          |0010 = ADC ADINT0 interrupt EOC pulse trigger.
     * |        |          |0011 = ADC ADINT1 interrupt EOC pulse trigger.
     * |        |          |0100 = Timer0 overflow pulse trigger.
     * |        |          |0101 = Timer1 overflow pulse trigger.
     * |        |          |0110 = Timer2 overflow pulse trigger.
     * |        |          |0111 = Timer3 overflow pulse trigger.
     * |        |          |1000 = EPWM0_CH0 trigger.
     * |        |          |1001 = EPWM0_CH2 trigger.
     * |        |          |1010 = EPWM0_CH4 trigger.
     * |        |          |1011 = EPWM1_CH0 trigger.
     * |        |          |1100 = EPWM1_CH2 trigger.
     * |        |          |1101 = EPWM1_CH4 trigger.
     * |        |          |1110 = PWM0_CH0 trigger.
     * |        |          |1111 = PWM0_CH1 trigger.
     * |[8:15]  |TRGDLYCNT |A/D SAMPLE Start Of Conversion Trigger Delay Time
     * |        |          |Trigger delay time = (TRGDLYCNT + 4) x Trigger delay clock period.
     * |[16:17] |TRGDLYDIV |A/D SAMPLE Start Of Conversion Trigger Delay Clock Divider Selection
     * |        |          |Trigger delay clock frequency:
     * |        |          |00 = ADC_CLK/1.
     * |        |          |01 = ADC_CLK/2.
     * |        |          |10 = ADC_CLK/4.
     * |        |          |11 = ADC_CLK/16.
     * |[20]    |EXTREN    |A/D External Pin Rising Edge Trigger Enable Control
     * |        |          |0 = A/D external pin rising edge trigger Disabled.
     * |        |          |1 = A/D external pin rising edge trigger Enabled.
     * |[21]    |EXTFEN    |A/D External Pin Falling Edge Trigger Enable Control
     * |        |          |0 = A/D external pin falling edge trigger Disabled.
     * |        |          |1 = A/D external pin falling edge trigger Enabled.
    */
    __IO uint32_t AD1SPCTL2;

