MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
#define EADC_AD1DAT0_RESULT_Pos          (0)                                               /*!< EADC_T::AD1DAT0: RESULT Position          */
#define EADC_AD1DAT0_RESULT_Msk          (0xffful << EADC_AD1DAT0_RESULT_Pos)              /*!< EADC_T::AD1DAT0: RESULT Mask              */

#define EADC_AD1DAT0_OV_Pos              (16)                                              /*!< EADC_T::AD1DAT0: OV Position              */
#define EADC_AD1DAT0_OV_Msk              (0x1ul << EADC_AD1DAT0_OV_Pos)                    /*!< EADC_T::AD1DAT0: OV Mask                  */

#define EADC_AD1DAT0_VALID_Pos           (17)                                              /*!< EADC_T::AD1DAT0: VALID Position           */
#define EADC_AD1DAT0_VALID_Msk           (0x1ul << EADC_AD1DAT0_VALID_Pos)                 /*!< EADC_T::AD1DAT0: VALID Mask               */

#define EADC_AD1DAT1_RESULT_Pos          (0)                                               /*!< EADC_T::AD1DAT1: RESULT Position          */
#define EADC_AD1DAT1_RESULT_Msk          (0xffful << EADC_AD1DAT1_RESULT_Pos)              /*!< EADC_T::AD1DAT1: RESULT Mask              */

#define EADC_AD1DAT1_OV_Pos              (16)                                              /*!< EADC_T::AD1DAT1: OV Position              */
#define EADC_AD1DAT1_OV_Msk              (0x1ul << EADC_AD1DAT1_OV_Pos)                    /*!< EADC_T::AD1DAT1: OV Mask                  */

#define EADC_AD1DAT1_VALID_Pos           (17)                                              /*!< EADC_T::AD1DAT1: VALID Position           */
#define EADC_AD1DAT1_VALID_Msk           (0x1ul << EADC_AD1DAT1_VALID_Pos)                 /*!< EADC_T::AD1DAT1: VALID Mask               */

#define EADC_AD1DAT2_RESULT_Pos          (0)                                               /*!< EADC_T::AD1DAT2: RESULT Position          */
#define EADC_AD1DAT2_RESULT_Msk          (0xffful << EADC_AD1DAT2_RESULT_Pos)              /*!< EADC_T::AD1DAT2: RESULT Mask              */

#define EADC_AD1DAT2_OV_Pos              (16)                                              /*!< EADC_T::AD1DAT2: OV Position              */
#define EADC_AD1DAT2_OV_Msk              (0x1ul << EADC_AD1DAT2_OV_Pos)                    /*!< EADC_T::AD1DAT2: OV Mask                  */

#define EADC_AD1DAT2_VALID_Pos           (17)                                              /*!< EADC_T::AD1DAT2: VALID Position           */
#define EADC_AD1DAT2_VALID_Msk           (0x1ul << EADC_AD1DAT2_VALID_Pos)                 /*!< EADC_T::AD1DAT2: VALID Mask               */

#define EADC_AD1DAT3_RESULT_Pos          (0)                                               /*!< EADC_T::AD1DAT3: RESULT Position          */
#define EADC_AD1DAT3_RESULT_Msk          (0xffful << EADC_AD1DAT3_RESULT_Pos)              /*!< EADC_T::AD1DAT3: RESULT Mask              */

#define EADC_AD1DAT3_OV_Pos              (16)                                              /*!< EADC_T::AD1DAT3: OV Position              */
#define EADC_AD1DAT3_OV_Msk              (0x1ul << EADC_AD1DAT3_OV_Pos)                    /*!< EADC_T::AD1DAT3: OV Mask                  */

#define EADC_AD1DAT3_VALID_Pos           (17)                                              /*!< EADC_T::AD1DAT3: VALID Position           */
#define EADC_AD1DAT3_VALID_Msk           (0x1ul << EADC_AD1DAT3_VALID_Pos)                 /*!< EADC_T::AD1DAT3: VALID Mask               */

#define EADC_AD1DAT4_RESULT_Pos          (0)                                               /*!< EADC_T::AD1DAT4: RESULT Position          */
#define EADC_AD1DAT4_RESULT_Msk          (0xffful << EADC_AD1DAT4_RESULT_Pos)              /*!< EADC_T::AD1DAT4: RESULT Mask              */

#define EADC_AD1DAT4_OV_Pos              (16)                                              /*!< EADC_T::AD1DAT4: OV Position              */
#define EADC_AD1DAT4_OV_Msk              (0x1ul << EADC_AD1DAT4_OV_Pos)                    /*!< EADC_T::AD1DAT4: OV Mask                  */

#define EADC_AD1DAT4_VALID_Pos           (17)                                              /*!< EADC_T::AD1DAT4: VALID Position           */
#define EADC_AD1DAT4_VALID_Msk           (0x1ul << EADC_AD1DAT4_VALID_Pos)                 /*!< EADC_T::AD1DAT4: VALID Mask               */

#define EADC_AD1DAT5_RESULT_Pos          (0)                                               /*!< EADC_T::AD1DAT5: RESULT Position          */
#define EADC_AD1DAT5_RESULT_Msk          (0xffful << EADC_AD1DAT5_RESULT_Pos)              /*!< EADC_T::AD1DAT5: RESULT Mask              */

#define EADC_AD1DAT5_OV_Pos              (16)                                              /*!< EADC_T::AD1DAT5: OV Position              */
#define EADC_AD1DAT5_OV_Msk              (0x1ul << EADC_AD1DAT5_OV_Pos)                    /*!< EADC_T::AD1DAT5: OV Mask                  */

#define EADC_AD1DAT5_VALID_Pos           (17)                                              /*!< EADC_T::AD1DAT5: VALID Position           */
#define EADC_AD1DAT5_VALID_Msk           (0x1ul << EADC_AD1DAT5_VALID_Pos)                 /*!< EADC_T::AD1DAT5: VALID Mask               */

#define EADC_AD1DAT6_RESULT_Pos          (0)                                               /*!< EADC_T::AD1DAT6: RESULT Position          */
#define EADC_AD1DAT6_RESULT_Msk          (0xffful << EADC_AD1DAT6_RESULT_Pos)              /*!< EADC_T::AD1DAT6: RESULT Mask              */

#define EADC_AD1DAT6_OV_Pos              (16)                                              /*!< EADC_T::AD1DAT6: OV Position              */
#define EADC_AD1DAT6_OV_Msk              (0x1ul << EADC_AD1DAT6_OV_Pos)                    /*!< EADC_T::AD1DAT6: OV Mask                  */

#define EADC_AD1DAT6_VALID_Pos           (17)                                              /*!< EADC_T::AD1DAT6: VALID Position           */
#define EADC_AD1DAT6_VALID_Msk           (0x1ul << EADC_AD1DAT6_VALID_Pos)                 /*!< EADC_T::AD1DAT6: VALID Mask               */

#define EADC_AD1DAT7_RESULT_Pos          (0)                                               /*!< EADC_T::AD1DAT7: RESULT Position          */
#define EADC_AD1DAT7_RESULT_Msk          (0xffful << EADC_AD1DAT7_RESULT_Pos)              /*!< EADC_T::AD1DAT7: RESULT Mask              */

#define EADC_AD1DAT7_OV_Pos              (16)                                              /*!< EADC_T::AD1DAT7: OV Position              */
#define EADC_AD1DAT7_OV_Msk              (0x1ul << EADC_AD1DAT7_OV_Pos)                    /*!< EADC_T::AD1DAT7: OV Mask                  */

