MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
#define EADC_INTSRC0_AD0SPIE4_Pos        (4)                                               /*!< EADC_T::INTSRC: AD0SPIE4 Position        */
#define EADC_INTSRC0_AD0SPIE4_Msk        (0x1ul << EADC_INTSRC0_AD0SPIE4_Pos)              /*!< EADC_T::INTSRC: AD0SPIE4 Mask            */

#define EADC_INTSRC0_AD0SPIE5_Pos        (5)                                               /*!< EADC_T::INTSRC: AD0SPIE5 Position        */
#define EADC_INTSRC0_AD0SPIE5_Msk        (0x1ul << EADC_INTSRC0_AD0SPIE5_Pos)              /*!< EADC_T::INTSRC: AD0SPIE5 Mask            */

#define EADC_INTSRC0_AD0SPIE6_Pos        (6)                                               /*!< EADC_T::INTSRC: AD0SPIE6 Position        */
#define EADC_INTSRC0_AD0SPIE6_Msk        (0x1ul << EADC_INTSRC0_AD0SPIE6_Pos)              /*!< EADC_T::INTSRC: AD0SPIE6 Mask            */

#define EADC_INTSRC0_AD0SPIE7_Pos        (7)                                               /*!< EADC_T::INTSRC: AD0SPIE7 Position        */
#define EADC_INTSRC0_AD0SPIE7_Msk        (0x1ul << EADC_INTSRC0_AD0SPIE7_Pos)              /*!< EADC_T::INTSRC: AD0SPIE7 Mask            */

#define EADC_INTSRC0_AD1SPIE0_Pos        (8)                                               /*!< EADC_T::INTSRC: AD1SPIE0 Position        */
#define EADC_INTSRC0_AD1SPIE0_Msk        (0x1ul << EADC_INTSRC0_AD1SPIE0_Pos)              /*!< EADC_T::INTSRC: AD1SPIE0 Mask            */

#define EADC_INTSRC0_AD1SPIE1_Pos        (9)                                               /*!< EADC_T::INTSRC: AD1SPIE1 Position        */
#define EADC_INTSRC0_AD1SPIE1_Msk        (0x1ul << EADC_INTSRC0_AD1SPIE1_Pos)              /*!< EADC_T::INTSRC: AD1SPIE1 Mask            */

#define EADC_INTSRC0_AD1SPIE2_Pos        (10)                                              /*!< EADC_T::INTSRC: AD1SPIE2 Position        */
#define EADC_INTSRC0_AD1SPIE2_Msk        (0x1ul << EADC_INTSRC0_AD1SPIE2_Pos)              /*!< EADC_T::INTSRC: AD1SPIE2 Mask            */

#define EADC_INTSRC0_AD1SPIE3_Pos        (11)                                              /*!< EADC_T::INTSRC: AD1SPIE3 Position        */
#define EADC_INTSRC0_AD1SPIE3_Msk        (0x1ul << EADC_INTSRC0_AD1SPIE3_Pos)              /*!< EADC_T::INTSRC: AD1SPIE3 Mask            */

#define EADC_INTSRC0_AD1SPIE4_Pos        (12)                                              /*!< EADC_T::INTSRC: AD1SPIE4 Position        */
#define EADC_INTSRC0_AD1SPIE4_Msk        (0x1ul << EADC_INTSRC0_AD1SPIE4_Pos)              /*!< EADC_T::INTSRC: AD1SPIE4 Mask            */

#define EADC_INTSRC0_AD1SPIE5_Pos        (13)                                              /*!< EADC_T::INTSRC: AD1SPIE5 Position        */
#define EADC_INTSRC0_AD1SPIE5_Msk        (0x1ul << EADC_INTSRC0_AD1SPIE5_Pos)              /*!< EADC_T::INTSRC: AD1SPIE5 Mask            */

#define EADC_INTSRC0_AD1SPIE6_Pos        (14)                                              /*!< EADC_T::INTSRC: AD1SPIE6 Position        */
#define EADC_INTSRC0_AD1SPIE6_Msk        (0x1ul << EADC_INTSRC0_AD1SPIE6_Pos)              /*!< EADC_T::INTSRC: AD1SPIE6 Mask            */

#define EADC_INTSRC0_AD1SPIE7_Pos        (15)                                              /*!< EADC_T::INTSRC: AD1SPIE7 Position        */
#define EADC_INTSRC0_AD1SPIE7_Msk        (0x1ul << EADC_INTSRC0_AD1SPIE7_Pos)              /*!< EADC_T::INTSRC: AD1SPIE7 Mask            */

#define EADC_INTSRC1_AD0SPIE0_Pos        (0)                                               /*!< EADC_T::INTSRC: AD0SPIE0 Position        */
#define EADC_INTSRC1_AD0SPIE0_Msk        (0x1ul << EADC_INTSRC1_AD0SPIE0_Pos)              /*!< EADC_T::INTSRC: AD0SPIE0 Mask            */

#define EADC_INTSRC1_AD0SPIE1_Pos        (1)                                               /*!< EADC_T::INTSRC: AD0SPIE1 Position        */
#define EADC_INTSRC1_AD0SPIE1_Msk        (0x1ul << EADC_INTSRC1_AD0SPIE1_Pos)              /*!< EADC_T::INTSRC: AD0SPIE1 Mask            */

#define EADC_INTSRC1_AD0SPIE2_Pos        (2)                                               /*!< EADC_T::INTSRC: AD0SPIE2 Position        */
#define EADC_INTSRC1_AD0SPIE2_Msk        (0x1ul << EADC_INTSRC1_AD0SPIE2_Pos)              /*!< EADC_T::INTSRC: AD0SPIE2 Mask            */

#define EADC_INTSRC1_AD0SPIE3_Pos        (3)                                               /*!< EADC_T::INTSRC: AD0SPIE3 Position        */
#define EADC_INTSRC1_AD0SPIE3_Msk        (0x1ul << EADC_INTSRC1_AD0SPIE3_Pos)              /*!< EADC_T::INTSRC: AD0SPIE3 Mask            */

#define EADC_INTSRC1_AD0SPIE4_Pos        (4)                                               /*!< EADC_T::INTSRC: AD0SPIE4 Position        */
#define EADC_INTSRC1_AD0SPIE4_Msk        (0x1ul << EADC_INTSRC1_AD0SPIE4_Pos)              /*!< EADC_T::INTSRC: AD0SPIE4 Mask            */

#define EADC_INTSRC1_AD0SPIE5_Pos        (5)                                               /*!< EADC_T::INTSRC: AD0SPIE5 Position        */
#define EADC_INTSRC1_AD0SPIE5_Msk        (0x1ul << EADC_INTSRC1_AD0SPIE5_Pos)              /*!< EADC_T::INTSRC: AD0SPIE5 Mask            */

#define EADC_INTSRC1_AD0SPIE6_Pos        (6)                                               /*!< EADC_T::INTSRC: AD0SPIE6 Position        */
#define EADC_INTSRC1_AD0SPIE6_Msk        (0x1ul << EADC_INTSRC1_AD0SPIE6_Pos)              /*!< EADC_T::INTSRC: AD0SPIE6 Mask            */

#define EADC_INTSRC1_AD0SPIE7_Pos        (7)                                               /*!< EADC_T::INTSRC: AD0SPIE7 Position        */
#define EADC_INTSRC1_AD0SPIE7_Msk        (0x1ul << EADC_INTSRC1_AD0SPIE7_Pos)              /*!< EADC_T::INTSRC: AD0SPIE7 Mask            */

#define EADC_INTSRC1_AD1SPIE0_Pos        (8)                                               /*!< EADC_T::INTSRC: AD1SPIE0 Position        */
#define EADC_INTSRC1_AD1SPIE0_Msk        (0x1ul << EADC_INTSRC1_AD1SPIE0_Pos)              /*!< EADC_T::INTSRC: AD1SPIE0 Mask            */

#define EADC_INTSRC1_AD1SPIE1_Pos        (9)                                               /*!< EADC_T::INTSRC: AD1SPIE1 Position        */
#define EADC_INTSRC1_AD1SPIE1_Msk        (0x1ul << EADC_INTSRC1_AD1SPIE1_Pos)              /*!< EADC_T::INTSRC: AD1SPIE1 Mask            */

#define EADC_INTSRC1_AD1SPIE2_Pos        (10)                                              /*!< EADC_T::INTSRC: AD1SPIE2 Position        */
#define EADC_INTSRC1_AD1SPIE2_Msk        (0x1ul << EADC_INTSRC1_AD1SPIE2_Pos)              /*!< EADC_T::INTSRC: AD1SPIE2 Mask            */

#define EADC_INTSRC1_AD1SPIE3_Pos        (11)                                              /*!< EADC_T::INTSRC: AD1SPIE3 Position        */
#define EADC_INTSRC1_AD1SPIE3_Msk        (0x1ul << EADC_INTSRC1_AD1SPIE3_Pos)              /*!< EADC_T::INTSRC: AD1SPIE3 Mask            */

#define EADC_INTSRC1_AD1SPIE4_Pos        (12)                                              /*!< EADC_T::INTSRC: AD1SPIE4 Position        */
#define EADC_INTSRC1_AD1SPIE4_Msk        (0x1ul << EADC_INTSRC1_AD1SPIE4_Pos)              /*!< EADC_T::INTSRC: AD1SPIE4 Mask            */

#define EADC_INTSRC1_AD1SPIE5_Pos        (13)                                              /*!< EADC_T::INTSRC: AD1SPIE5 Position        */
#define EADC_INTSRC1_AD1SPIE5_Msk        (0x1ul << EADC_INTSRC1_AD1SPIE5_Pos)              /*!< EADC_T::INTSRC: AD1SPIE5 Mask            */

#define EADC_INTSRC1_AD1SPIE6_Pos        (14)                                              /*!< EADC_T::INTSRC: AD1SPIE6 Position        */
#define EADC_INTSRC1_AD1SPIE6_Msk        (0x1ul << EADC_INTSRC1_AD1SPIE6_Pos)              /*!< EADC_T::INTSRC: AD1SPIE6 Mask            */

#define EADC_INTSRC1_AD1SPIE7_Pos        (15)                                              /*!< EADC_T::INTSRC: AD1SPIE7 Position        */
#define EADC_INTSRC1_AD1SPIE7_Msk        (0x1ul << EADC_INTSRC1_AD1SPIE7_Pos)              /*!< EADC_T::INTSRC: AD1SPIE7 Mask            */

