MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
#define EADC_INTSRC3_AD0SPIE7_Pos        (7)                                               /*!< EADC_T::INTSRC: AD0SPIE7 Position        */
#define EADC_INTSRC3_AD0SPIE7_Msk        (0x1ul << EADC_INTSRC3_AD0SPIE7_Pos)              /*!< EADC_T::INTSRC: AD0SPIE7 Mask            */

#define EADC_INTSRC3_AD1SPIE0_Pos        (8)                                               /*!< EADC_T::INTSRC: AD1SPIE0 Position        */
#define EADC_INTSRC3_AD1SPIE0_Msk        (0x1ul << EADC_INTSRC3_AD1SPIE0_Pos)              /*!< EADC_T::INTSRC: AD1SPIE0 Mask            */

#define EADC_INTSRC3_AD1SPIE1_Pos        (9)                                               /*!< EADC_T::INTSRC: AD1SPIE1 Position        */
#define EADC_INTSRC3_AD1SPIE1_Msk        (0x1ul << EADC_INTSRC3_AD1SPIE1_Pos)              /*!< EADC_T::INTSRC: AD1SPIE1 Mask            */

#define EADC_INTSRC3_AD1SPIE2_Pos        (10)                                              /*!< EADC_T::INTSRC: AD1SPIE2 Position        */
#define EADC_INTSRC3_AD1SPIE2_Msk        (0x1ul << EADC_INTSRC3_AD1SPIE2_Pos)              /*!< EADC_T::INTSRC: AD1SPIE2 Mask            */

#define EADC_INTSRC3_AD1SPIE3_Pos        (11)                                              /*!< EADC_T::INTSRC: AD1SPIE3 Position        */
#define EADC_INTSRC3_AD1SPIE3_Msk        (0x1ul << EADC_INTSRC3_AD1SPIE3_Pos)              /*!< EADC_T::INTSRC: AD1SPIE3 Mask            */

#define EADC_INTSRC3_AD1SPIE4_Pos        (12)                                              /*!< EADC_T::INTSRC: AD1SPIE4 Position        */
#define EADC_INTSRC3_AD1SPIE4_Msk        (0x1ul << EADC_INTSRC3_AD1SPIE4_Pos)              /*!< EADC_T::INTSRC: AD1SPIE4 Mask            */

#define EADC_INTSRC3_AD1SPIE5_Pos        (13)                                              /*!< EADC_T::INTSRC: AD1SPIE5 Position        */
#define EADC_INTSRC3_AD1SPIE5_Msk        (0x1ul << EADC_INTSRC3_AD1SPIE5_Pos)              /*!< EADC_T::INTSRC: AD1SPIE5 Mask            */

#define EADC_INTSRC3_AD1SPIE6_Pos        (14)                                              /*!< EADC_T::INTSRC: AD1SPIE6 Position        */
#define EADC_INTSRC3_AD1SPIE6_Msk        (0x1ul << EADC_INTSRC3_AD1SPIE6_Pos)              /*!< EADC_T::INTSRC: AD1SPIE6 Mask            */

#define EADC_INTSRC3_AD1SPIE7_Pos        (15)                                              /*!< EADC_T::INTSRC: AD1SPIE7 Position        */
#define EADC_INTSRC3_AD1SPIE7_Msk        (0x1ul << EADC_INTSRC3_AD1SPIE7_Pos)              /*!< EADC_T::INTSRC: AD1SPIE7 Mask            */

#define EADC_AD0TRGEN0_EPWM00REN_Pos     (0)                                               /*!< EADC_T::AD0TRGEN0: EPWM00REN Position     */
#define EADC_AD0TRGEN0_EPWM00REN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM00REN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM00REN Mask         */

#define EADC_AD0TRGEN0_EPWM00FEN_Pos     (1)                                               /*!< EADC_T::AD0TRGEN0: EPWM00FEN Position     */
#define EADC_AD0TRGEN0_EPWM00FEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM00FEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM00FEN Mask         */

#define EADC_AD0TRGEN0_EPWM00PEN_Pos     (2)                                               /*!< EADC_T::AD0TRGEN0: EPWM00PEN Position     */
#define EADC_AD0TRGEN0_EPWM00PEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM00PEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM00PEN Mask         */

#define EADC_AD0TRGEN0_EPWM00CEN_Pos     (3)                                               /*!< EADC_T::AD0TRGEN0: EPWM00CEN Position     */
#define EADC_AD0TRGEN0_EPWM00CEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM00CEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM00CEN Mask         */

#define EADC_AD0TRGEN0_EPWM02REN_Pos     (4)                                               /*!< EADC_T::AD0TRGEN0: EPWM02REN Position     */
#define EADC_AD0TRGEN0_EPWM02REN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM02REN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM02REN Mask         */

#define EADC_AD0TRGEN0_EPWM02FEN_Pos     (5)                                               /*!< EADC_T::AD0TRGEN0: EPWM02FEN Position     */
#define EADC_AD0TRGEN0_EPWM02FEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM02FEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM02FEN Mask         */

#define EADC_AD0TRGEN0_EPWM02PEN_Pos     (6)                                               /*!< EADC_T::AD0TRGEN0: EPWM02PEN Position     */
#define EADC_AD0TRGEN0_EPWM02PEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM02PEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM02PEN Mask         */

#define EADC_AD0TRGEN0_EPWM02CEN_Pos     (7)                                               /*!< EADC_T::AD0TRGEN0: EPWM02CEN Position     */
#define EADC_AD0TRGEN0_EPWM02CEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM02CEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM02CEN Mask         */

#define EADC_AD0TRGEN0_EPWM04REN_Pos     (8)                                               /*!< EADC_T::AD0TRGEN0: EPWM04REN Position     */
#define EADC_AD0TRGEN0_EPWM04REN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM04REN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM04REN Mask         */

#define EADC_AD0TRGEN0_EPWM04FEN_Pos     (9)                                               /*!< EADC_T::AD0TRGEN0: EPWM04FEN Position     */
#define EADC_AD0TRGEN0_EPWM04FEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM04FEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM04FEN Mask         */

#define EADC_AD0TRGEN0_EPWM04PEN_Pos     (10)                                              /*!< EADC_T::AD0TRGEN0: EPWM04PEN Position     */
#define EADC_AD0TRGEN0_EPWM04PEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM04PEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM04PEN Mask         */

#define EADC_AD0TRGEN0_EPWM04CEN_Pos     (11)                                              /*!< EADC_T::AD0TRGEN0: EPWM04CEN Position     */
#define EADC_AD0TRGEN0_EPWM04CEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM04CEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM04CEN Mask         */

#define EADC_AD0TRGEN0_EPWM10REN_Pos     (12)                                              /*!< EADC_T::AD0TRGEN0: EPWM10REN Position     */
#define EADC_AD0TRGEN0_EPWM10REN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM10REN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM10REN Mask         */

#define EADC_AD0TRGEN0_EPWM10FEN_Pos     (13)                                              /*!< EADC_T::AD0TRGEN0: EPWM10FEN Position     */
#define EADC_AD0TRGEN0_EPWM10FEN_Msk     (0x1ul << EADC_AD0TRGEN0_EPWM10FEN_Pos)           /*!< EADC_T::AD0TRGEN0: EPWM10FEN Mask         */

