MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
#define EADC_AD1TRGEN3_PWM01CEN_Pos      (31)                                              /*!< EADC_T::AD1TRGEN3: PWM01CEN Position      */
#define EADC_AD1TRGEN3_PWM01CEN_Msk      (0x1ul << EADC_AD1TRGEN3_PWM01CEN_Pos)            /*!< EADC_T::AD1TRGEN3: PWM01CEN Mask          */

/**@}*/ /* EADC_CONST */
/**@}*/ /* end of EADC register group */


/*---------------------- External Bus Interface Controller -------------------------*/
/**
    @addtogroup EBI External Bus Interface Controller(EBI)
    Memory Mapped Structure for EBI Controller
@{ */

typedef struct {


    /**
     * CTL
     * ===================================================================================================
     * Offset: 0x00  External Bus Interface General Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[8:10]  |MCLKDIV   |External Output Clock Divider
     * |        |          |The frequency of EBI output clock is controlled by MCLKDIV as below:
     * |        |          |000 = HCLK/1.
     * |        |          |001 = HCLK/2.
     * |        |          |010 = HCLK/4.
     * |        |          |011 = HCLK/8.
     * |        |          |100 = HCLK/16.
     * |        |          |101 = HCLK/32.
     * |        |          |11x = Default.
     * |        |          |Note: Default value of output clock is HCLK/1
     * |[24:27] |CRYPTOEN  |Encrypt/Decrypt Function Enable Control (For 4 Individual Chip Select)
     * |        |          |0 = Encrypt/Decrypt function Disabled.
     * |        |          |1 = Encrypt/Decrypt function Enabled.
     * |[28:31] |CSPOLINV  |Reverse Chip Select
     * |        |          |The original design Chip Select is active low nCS.
     * |        |          |"Chip Select Active High" can be specified by customers-Bit[28+n] is for nCS[n], where n=0~3.
     * |        |          |0 = nCS (chip select active low).
     * |        |          |1 = CS (chip select active high).
    */
    __IO uint32_t CTL;

    /**
     * TCTL
     * ===================================================================================================
     * Offset: 0x04 - 0x10  External Bus Interface Bank0~3 Timing Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:2]   |TALE      |Bank Expand Time Of ALE
     * |        |          |The ALE width (tALE) to latch the address can be controlled by TALE.
     * |        |          |tALE = (TALE+1)*MCLK.
     * |[3:7]   |TACC      |EBI Bank Data Access Time
     * |        |          |TACC define data access time (tACC).
     * |        |          |tACC = (TACC +1) * MCLK.
     * |[8:10]  |TAHD      |EBI Bank Data Access Hold Time
     * |        |          |TAHD define data access hold time (tAHD).
     * |        |          |tAHD = (TAHD +1) * MCLK.
     * |[12:15] |W2X       |Bank Idle State Cycle After Write
     * |        |          |When write action is finish, idle state is inserted and nCS[0] return to high if W2X is not zero.
     * |        |          |Idle state cycle = (W2X*MCLK).
     * |        |          |0 = reserved.
     * |[16:19] |R2W       |Bank Idle State Cycle Between Read-Write
     * |        |          |When read action is finish and next action is going to write, idle state is inserted and nCS[0] return to high if R2W is not zero.
     * |        |          |Idle state cycle = (R2W*MCLK).
     * |        |          |0 = reserved.
     * |[24:27] |R2R       |Bank Idle State Cycle Between Read-Read
     * |        |          |When read action is finish and next action is going to read, idle state is inserted and nCS[0] return to high if R2R is not zero.
     * |        |          |Idle state cycle = (R2R*MCLK).
     * |        |          |0 = reserved.
     * |[28]    |CSEN      |EBI Bank Enable Control
     * |        |          |This bit is the functional enable bit for EBI.
     * |        |          |0 = EBI function Disabled.
     * |        |          |1 = EBI function Enabled.
     * |[29]    |DW16      |EBI Bank Data Width 16-Bit
     * |        |          |This bit defines if the data bus is 8-bit or 16-bit.
     * |        |          |0 = EBI data width is 8-bit.
     * |        |          |1 = EBI data width is 16-bit.
     * |[30]    |SEPEN     |EBI Bank Address/Data Bus Separating Enable Control
     * |        |          |0 = Address/Data Bus Separating Disabled.
     * |        |          |1 = Address/Data Bus Separating Enabled.
    */
    __IO uint32_t TCTL[4];

    /**
     * KEY0
     * ===================================================================================================
     * Offset: 0x14  External Bus Interface Crypto Key Word 0
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEY0      |Crypto Key Word 0 (key[31:0]).
    */
    __IO uint32_t KEY0;

    /**
     * KEY1
     * ===================================================================================================
     * Offset: 0x18  External Bus Interface Crypto Key Word 1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEY       |Crypto Key Word 1 (key[63:32]).
    */
    __IO uint32_t KEY1;

    /**
     * KEY2
     * ===================================================================================================
     * Offset: 0x1C  External Bus Interface Crypto Key Word 2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEY       |Crypto Key Word 2 (key[95:64]).
    */
    __IO uint32_t KEY2;

    /**
     * KEY3
     * ===================================================================================================
     * Offset: 0x20  External Bus Interface Crypto Key Word 3
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |KEY       |Crypto Key Word 3 (key[127:96]).
    */
    __IO uint32_t KEY3;

