MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
#define FMC_ISPCTL_CFGUEN_Pos            (4)                                               /*!< FMC_T::ISPCTL: CFGUEN Position            */
#define FMC_ISPCTL_CFGUEN_Msk            (0x1ul << FMC_ISPCTL_CFGUEN_Pos)                  /*!< FMC_T::ISPCTL: CFGUEN Mask                */

#define FMC_ISPCTL_LDUEN_Pos             (5)                                               /*!< FMC_T::ISPCTL: LDUEN Position             */
#define FMC_ISPCTL_LDUEN_Msk             (0x1ul << FMC_ISPCTL_LDUEN_Pos)                   /*!< FMC_T::ISPCTL: LDUEN Mask                 */

#define FMC_ISPCTL_ISPFF_Pos             (6)                                               /*!< FMC_T::ISPCTL: ISPFF Position             */
#define FMC_ISPCTL_ISPFF_Msk             (0x1ul << FMC_ISPCTL_ISPFF_Pos)                   /*!< FMC_T::ISPCTL: ISPFF Mask                 */

#define FMC_ISPADDR_ISPADDR_Pos          (0)                                               /*!< FMC_T::ISPADDR: ISPADDR Position          */
#define FMC_ISPADDR_ISPADDR_Msk          (0xfffffffful << FMC_ISPADDR_ISPADDR_Pos)         /*!< FMC_T::ISPADDR: ISPADDR Mask              */

#define FMC_ISPDAT_ISPDAT_Pos            (0)                                               /*!< FMC_T::ISPDAT: ISPDAT Position            */
#define FMC_ISPDAT_ISPDAT_Msk            (0xfffffffful << FMC_ISPDAT_ISPDAT_Pos)           /*!< FMC_T::ISPDAT: ISPDAT Mask                */

#define FMC_ISPCMD_CMD_Pos               (0)                                               /*!< FMC_T::ISPCMD: CMD Position               */
#define FMC_ISPCMD_CMD_Msk               (0x3ful << FMC_ISPCMD_CMD_Pos)                    /*!< FMC_T::ISPCMD: CMD Mask                   */

#define FMC_ISPTRG_ISPGO_Pos             (0)                                               /*!< FMC_T::ISPTRG: ISPGO Position             */
#define FMC_ISPTRG_ISPGO_Msk             (0x1ul << FMC_ISPTRG_ISPGO_Pos)                   /*!< FMC_T::ISPTRG: ISPGO Mask                 */

#define FMC_DFBA_DFBA_Pos                (0)                                               /*!< FMC_T::DFBA: DFBA Position                */
#define FMC_DFBA_DFBA_Msk                (0xfffffffful << FMC_DFBA_DFBA_Pos)               /*!< FMC_T::DFBA: DFBA Mask                    */

#define FMC_FTCTL_FOM_Pos                (4)                                               /*!< FMC_T::FTCTL: FOM Position                */
#define FMC_FTCTL_FOM_Msk                (0x7ul << FMC_FTCTL_FOM_Pos)                      /*!< FMC_T::FTCTL: FOM Mask                    */

#define FMC_ISPSTS_ISPBUSY_Pos           (0)                                               /*!< FMC_T::ISPSTS: ISPBUSY Position           */
#define FMC_ISPSTS_ISPBUSY_Msk           (0x1ul << FMC_ISPSTS_ISPBUSY_Pos)                 /*!< FMC_T::ISPSTS: ISPBUSY Mask               */

#define FMC_ISPSTS_CBS_Pos               (1)                                               /*!< FMC_T::ISPSTS: CBS Position               */
#define FMC_ISPSTS_CBS_Msk               (0x3ul << FMC_ISPSTS_CBS_Pos)                     /*!< FMC_T::ISPSTS: CBS Mask                   */

#define FMC_ISPSTS_ISPFF_Pos             (6)                                               /*!< FMC_T::ISPSTS: ISPFF Position             */
#define FMC_ISPSTS_ISPFF_Msk             (0x1ul << FMC_ISPSTS_ISPFF_Pos)                   /*!< FMC_T::ISPSTS: ISPFF Mask                 */

#define FMC_ISPSTS_VECMAP_Pos            (9)                                               /*!< FMC_T::ISPSTS: VECMAP Position            */
#define FMC_ISPSTS_VECMAP_Msk            (0xffful << FMC_ISPSTS_VECMAP_Pos)                /*!< FMC_T::ISPSTS: VECMAP Mask                */

#define FMC_ISPSTS_CFGCRCF_Pos           (26)                                              /*!< FMC_T::ISPSTS: CFGCRCF Position           */
#define FMC_ISPSTS_CFGCRCF_Msk           (0x1ul << FMC_ISPSTS_CFGCRCF_Pos)                 /*!< FMC_T::ISPSTS: CFGCRCF Mask               */

#define FMC_FBWP_BWP_Pos                 (0)                                               /*!< FMC_T::FBWP: BWP Position                 */
#define FMC_FBWP_BWP_Msk                 (0xfffffffful << FMC_FBWP_BWP_Pos)                /*!< FMC_T::FBWP: BWP Mask                     */

#define FMC_MPDAT0_ISPDAT0_Pos          (0)                                                /*!< FMC_T::MPDAT0: ISPDAT0 Position           */
#define FMC_MPDAT0_ISPDAT0_Msk          (0xfffffffful << FMC_MPDAT0_ISPDAT0_Pos)           /*!< FMC_T::MPDAT0: ISPDAT0 Mask               */

#define FMC_MPDAT1_ISPDAT1_Pos          (0)                                                /*!< FMC_T::MPDAT1: ISPDAT1 Position           */
#define FMC_MPDAT1_ISPDAT1_Msk          (0xfffffffful << FMC_MPDAT1_ISPDAT1_Pos)           /*!< FMC_T::MPDAT1: ISPDAT1 Mask               */

#define FMC_MPDAT2_ISPDAT2_Pos          (0)                                                /*!< FMC_T::MPDAT2: ISPDAT2 Position           */
#define FMC_MPDAT2_ISPDAT2_Msk          (0xfffffffful << FMC_MPDAT2_ISPDAT2_Pos)           /*!< FMC_T::MPDAT2: ISPDAT2 Mask               */

#define FMC_MPDAT3_ISPDAT3_Pos          (0)                                                /*!< FMC_T::MPDAT3: ISPDAT3 Position           */
#define FMC_MPDAT3_ISPDAT3_Msk          (0xfffffffful << FMC_MPDAT3_ISPDAT3_Pos)           /*!< FMC_T::MPDAT3: ISPDAT3 Mask               */

#define FMC_MPSTS_MPBUSY_Pos           (0)                                                 /*!< FMC_T::MPSTS: WMPBUSY Position            */
#define FMC_MPSTS_MPBUSY_Msk           (0x1ul << FMC_MPSTS_MPBUSY_Pos)                     /*!< FMC_T::MPSTS: MPBUSY Mask                 */

#define FMC_MPSTS_ISPFF_Pos             (2)                                                /*!< FMC_T::MPSTS: ISPFF Position              */
#define FMC_MPSTS_ISPFF_Msk             (0x1ul << FMC_MPSTS_ISPFF_Pos)                     /*!< FMC_T::MPSTS: ISPFF Mask                  */

#define FMC_MPSTS_D0_Pos                (4)                                                /*!< FMC_T::MPSTS: D0 Position                 */
#define FMC_MPSTS_D0_Msk                (0x1ul << FMC_MPSTS_D0_Pos)                        /*!< FMC_T::MPSTS: D0 Mask                     */

#define FMC_MPSTS_D1_Pos                (5)                                                /*!< FMC_T::MPSTS: D1 Position                 */
#define FMC_MPSTS_D1_Msk                (0x1ul << FMC_MPSTS_D1_Pos)                        /*!< FMC_T::MPSTS: D1 Mask                     */

#define FMC_MPSTS_D2_Pos                (6)                                                /*!< FMC_T::MPSTS: D2 Position                 */
#define FMC_MPSTS_D2_Msk                (0x1ul << FMC_MPSTS_D2_Pos)                        /*!< FMC_T::MPSTS: D2 Mask                     */

#define FMC_MPSTS_D3_Pos                (7)                                                /*!< FMC_T::MPSTS: D3 Position                 */
#define FMC_MPSTS_D3_Msk                (0x1ul << FMC_MPSTS_D3_Pos)                        /*!< FMC_T::MPSTS: D3 Mask                     */

