MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
#define FMC_MPADDR_MPADDR_Pos           (0)                                                /*!< FMC_T::MPADDR: MPADDR Position            */
#define FMC_MPADDR_MPADDR_Msk           (0xfffffffful << FMC_MPADDR_MPADDR_Pos)            /*!< FMC_T::MPADDR: MPADDR Mask                */

/**@}*/ /* FMC_CONST */
/**@}*/ /* end of FMC register group */


/*---------------------- General Purpose Input/Output Controller -------------------------*/
/**
    @addtogroup GPIO General Purpose Input/Output Controller(GPIO)
    Memory Mapped Structure for GPIO Controller
@{ */

typedef struct {


    /**
     * Px_MODE
     * ===================================================================================================
     * Offset: 0x00  Px I/O Mode Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:1]   |MODE0     |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[2:3]   |MODE1     |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[4:5]   |MODE2     |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[6:7]   |MODE3     |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[8:9]   |MODE4     |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[10:11] |MODE5     |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[12:13] |MODE6     |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[14:15] |MODE7     |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[16:17] |MODE8     |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[18:19] |MODE9     |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[20:21] |MODE10    |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[22:23] |MODE11    |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[24:25] |MODE12    |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[26:27] |MODE13    |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[28:29] |MODE14    |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
     * |[30:31] |MODE15    |Port N Bit M I/O Mode Control
     * |        |          |Determine the I/O mode of port n bit m.
     * |        |          |00 = INPUT only mode.
     * |        |          |01 = OUTPUT mode.
     * |        |          |10 = Open-drain mode.
     * |        |          |11 = Quasi-bidirectional mode.
     * |        |          |Reset value:
     * |        |          |0xFFFF_FFFF when ( cfg_io =1'b0).
     * |        |          |0x0000_00000 when ( cfg_io =1'b1).
    */
    __IO uint32_t MODE;

    /**
     * Px_DINOFF
     * ===================================================================================================
     * Offset: 0x04  Px Digital Input Path Disable Control
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[16]    |DINOFF0   |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[17]    |DINOFF1   |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[18]    |DINOFF2   |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[19]    |DINOFF3   |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[20]    |DINOFF4   |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[21]    |DINOFF5   |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[22]    |DINOFF6   |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[23]    |DINOFF7   |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[24]    |DINOFF8   |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[25]    |DINOFF9   |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[26]    |DINOFF10  |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[27]    |DINOFF11  |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[28]    |DINOFF12  |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[29]    |DINOFF13  |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[30]    |DINOFF14  |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
     * |[31]    |DINOFF15  |Port N Bit M Off Digital Input Path
     * |        |          |Each of these bits is used to turn off the digital input path of port n bit m pin.
     * |        |          |If input is analog signal, users can turn off digital input path to avoid input current leakage.
     * |        |          |0 = Digital input path Enabled.
     * |        |          |1 = Digital input path Disabled (Digital input is tied to low).
    */
    __IO uint32_t DINOFF;

    /**
     * Px_DOUT
     * ===================================================================================================
     * Offset: 0x08  Px Data Output Value
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |DOUT0     |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[1]     |DOUT1     |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[2]     |DOUT2     |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[3]     |DOUT3     |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[4]     |DOUT4     |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[5]     |DOUT5     |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[6]     |DOUT6     |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[7]     |DOUT7     |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[8]     |DOUT8     |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[9]     |DOUT9     |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[10]    |DOUT10    |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[11]    |DOUT11    |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[12]    |DOUT12    |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[13]    |DOUT13    |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[14]    |DOUT14    |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
     * |[15]    |DOUT15    |Port N Bit M Output
     * |        |          |Each of these bits control the status of port n bit m when this pin is configures as output, open-drain, or Quasi-bidirectional mode.
     * |        |          |0 = Drive port n bit m high low.
     * |        |          |1 = Drive port n bit m high level.
    */
    __IO uint32_t DOUT;

