MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
#define OPA_CTL_OPAIE0_Pos               (8)                                               /*!< OPA_T::CTL: OPAIE0 Position               */
#define OPA_CTL_OPAIE0_Msk               (0x1ul << OPA_CTL_OPAIE0_Pos)                     /*!< OPA_T::CTL: OPAIE0 Mask                   */

#define OPA_CTL_OPAIE1_Pos               (9)                                               /*!< OPA_T::CTL: OPAIE1 Position               */
#define OPA_CTL_OPAIE1_Msk               (0x1ul << OPA_CTL_OPAIE1_Pos)                     /*!< OPA_T::CTL: OPAIE1 Mask                   */

#define OPA_STATUS_OPDO0_Pos             (0)                                               /*!< OPA_T::STATUS: OPDO0 Position             */
#define OPA_STATUS_OPDO0_Msk             (0x1ul << OPA_STATUS_OPDO0_Pos)                   /*!< OPA_T::STATUS: OPDO0 Mask                 */

#define OPA_STATUS_OPDO1_Pos             (1)                                               /*!< OPA_T::STATUS: OPDO1 Position             */
#define OPA_STATUS_OPDO1_Msk             (0x1ul << OPA_STATUS_OPDO1_Pos)                   /*!< OPA_T::STATUS: OPDO1 Mask                 */

#define OPA_STATUS_OPDF0_Pos             (4)                                               /*!< OPA_T::STATUS: OPDF0 Position             */
#define OPA_STATUS_OPDF0_Msk             (0x1ul << OPA_STATUS_OPDF0_Pos)                   /*!< OPA_T::STATUS: OPDF0 Mask                 */

#define OPA_STATUS_OPDF1_Pos             (5)                                               /*!< OPA_T::STATUS: OPDF1 Position             */
#define OPA_STATUS_OPDF1_Msk             (0x1ul << OPA_STATUS_OPDF1_Pos)                   /*!< OPA_T::STATUS: OPDF1 Mask                 */

/**@}*/ /* OPA_CONST */
/**@}*/ /* end of OPA register group */


/*---------------------- USB On-The-Go Controller -------------------------*/
/**
    @addtogroup OTG USB On-The-Go Controller(OTG)
    Memory Mapped Structure for OTG Controller
@{ */

typedef struct {


    /**
     * CTL
     * ===================================================================================================
     * Offset: 0x00  OTG Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |VBUSDROP  |Drop The VUSB Bus
     * |        |          |If user application running on this OTG A-device wants to conserve power consumption, set this bit to high When set this bit to TRUE, BUSREQ shall be cleared as well.
     * |        |          |0 = Did Not drop the VBUS and keep going on USB data transfers.
     * |        |          |1 = Drop the VBUS to conserve power consumption.
     * |[1]     |BUSREQ    |OTG A-Device Bus Request
     * |        |          |If user application of an OTG A-device wants to do data transfers via USB bus, set this bit to high Otherwise if user application won't use the bus any more, set this bit to low.
     * |        |          |This bit will be automatically cleared if VBUSDROP bit is set to TRUE.
     * |[2]     |HNPREQEN  |OTG B-Device HNP Enable/Request
     * |        |          |Set this bit to TRUE after the OTG A-device successfully sends a SetFeature(b_hnp_enable) command to the OTG B-device This bit will be cleared automatically when a bus reset or SESS_VLD goes from TRUE to FALSE.
     * |[4]     |OTGEN     |OTG Function Enable Control
     * |        |          |If USB is configured as OTG device, this bit must set high.
     * |        |          |0= OTG function Disabled.
     * |        |          |1 = OTG function Enabled.
     * |[7]     |PDEVCKON  |Force OTG PHY Output Clock To USB Device
     * |        |          |If software configures OTG controller as OTG device and OTG device as A-device, OTG controller will output OTG PHY clock (30 MHz) to USB device only when OTG device as A-peripheral.
     * |        |          |If software needs to configure USB device before role change (from A-Host to A-Peripheral), software can set this bit high to output OTG PHY clock to USB device.
     * |        |          |0= USB device clock is available only when OTG device as a peripheral.
     * |        |          |1 = Force output OTG PHY clock to USB device.
     * |[8]     |WKEN      |OTG Wake-Up Enable Control
     * |        |          |0= OTG ID pin status change wake-up Disabled.
     * |        |          |1 = OTG ID pin status change wake-up Enabled.
    */
    __IO uint32_t CTL;

    /**
     * PHYCTL
     * ===================================================================================================
     * Offset: 0x04  OTG PHY Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |SWPDEN    |Software Control Pull-Down On Data Lines Enable Control
     * |        |          |0 = Pull-down resistors on data lines is controlled by OTG control logic.
     * |        |          |1 = Pull-down resistors on data lines is controlled by software.
     * |        |          |Note: Software must set this bit high before controlling DPPDEN and DMPDEN.
     * |[1]     |DPPDEN    |D+ Pull-Down Enable Control Set SWPDEN to TRUE before using this function
     * |        |          |0 = 15 kOhm resistor pull-down on D+ pin Disabled.
     * |        |          |1 = 15 kOhm resistor pull-down on D+ pin Enabled.
     * |[2]     |DMPDEN    |D- Pull-Down Enable Control Set SWPDEN to TRUE before using this function
     * |        |          |0 = 15 kOhm resistor pull-down on D- pin Disabled.
     * |        |          |1 = 15 kOhm resistor pull-down on D- pin Enabled.
     * |[5]     |VBSTSPOL  |Off-Chip USB VBUS Power Status Polarity
     * |        |          |The polarity of off-chip USB VBUS LDO valid depends on the selected component.
     * |        |          |This bit provides the inversed option of off-chip USB VBUS LDO valid.
     * |        |          |0 = The polarity of off-chip USB VBUS LDO valid not inversed.
     * |        |          |1 = The polarity of off-chip USB VBUS LDO valid inversed.
     * |[6]     |VBENPOL   |Off-Chip USB VBUS Power Enable Polarity
     * |        |          |The OTG controller will enable off-chip USB VBUS LDO to provide VBUS power when need.
     * |        |          |The polarity of enabling off-chip BSU VBUS LDO (high active or low active) depends on the selected component.
     * |        |          |This bit provides the inverse option of off-chip USB VBUS LDO enable.
     * |        |          |0 = The polarity of enabling off-chip USB VBUS LDO from the OTG controller not inversed.
     * |        |          |1 = The polarity of enabling off-chip USB VBUS LDO from the OTG controller inversed.
     * |[7]     |IDDETEN   |ID Detection Enable
     * |        |          |0 = Sampling on ID pin Enabled.
     * |        |          |1 = Sampling on ID pin Disabled.
     * |[8]     |PHYCLK    |PHY Input Clock Selection
     * |        |          |0 = PHY input clock is12 MHz.
     * |        |          |1 = PHY input clock is 24 MHz.
     * |[9]     |OTGPHYEN  |OTG PHY Enable Control When Device Configured As OTG-Device
     * |        |          |When device is configured as OTG-device, hardware will not enable OTG PHY automatically.
     * |        |          |Software can set OTG_EN to enable OTG PHY.
     * |        |          |0 = OTG PHY Disabled.
     * |        |          |1 = OTG PHY Enabled.
    */
    __IO uint32_t PHYCTL;

    /**
     * INTEN
     * ===================================================================================================
     * Offset: 0x08  OTG Interrupt Enable Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ROLECHGIEN|Role(Host Or Peripheral) Changed Interrupt Enable Control
     * |        |          |0 = Interrupt Disabled.
     * |        |          |1 = Interrupt Enabled.
     * |[1]     |VBEIEN    |VBUS Error Interrupt Enable Control
     * |        |          |0 = Interrupt Disabled.
     * |        |          |1 = Interrupt Enabled.
     * |        |          |Note: VBUS error means going to a_vbus_err state. Please refer to A-device state diagram in OTG spec.
     * |[2]     |SRPFIEN   |SRP Fail Interrupt Enable Control
     * |        |          |0 = Interrupt Disabled.
     * |        |          |1 = Interrupt Enabled.
     * |[3]     |HNPFIEN   |HNP Fail Interrupt Enable Control
     * |        |          |0 = Interrupt Disabled.
     * |        |          |1 = Interrupt Enabled.
     * |[4]     |GOIDLEIEN |OTG Device Goes IDLE State Interrupt Enable Control
     * |        |          |0 = Interrupt Disabled.
     * |        |          |1 = Interrupt Enabled.
     * |        |          |Note: Going to idle state means going to a_idle or b_idle state.
     * |        |          |Please refer to A-device state diagram and B-device state diagram in OTG spec.
     * |[5]     |IDCHGIEN  |IDSTS Changed Interrupt Enable
     * |        |          |0 = Interrupt Disabled.
     * |        |          |1 = Interrupt Enabled.
     * |[6]     |PDEVIEN   |Act As Peripheral Interrupt Enable Control
     * |        |          |0 = This device as a peripheral interrupt Disabled.
     * |        |          |1 = This device as a peripheral interrupt Enabled.
     * |[7]     |HOSTIEN   |Act As Host Interrupt Enable Control
     * |        |          |0= This device as a host interrupt Disabled.
     * |        |          |1 = This device as a host interrupt Enabled.
     * |[8]     |BVLDCHGIEN|B-Device Session Valid Status Change (From High To Low Or From Low To High) Interrupt Enable Control
     * |        |          |0 =Interrupt Disabled.
     * |        |          |1 = Interrupt Enabled.
     * |[9]     |AVLDCHGIEN|A-Device Session Valid Status Change (From High To Low Or From Low To High) Interrupt Enable Control
     * |        |          |0 = Interrupt Disabled.
     * |        |          |1 = Interrupt Enabled.
     * |[10]    |VBCHGIEN  |VBVALID Status Changed Interrupt Enable
     * |        |          |0 = Interrupt Disabled.
     * |        |          |1 = Interrupt Enabled.
     * |[11]    |SECHGIEN  |SESSEND Status Changed Interrupt Enable Control 0 = Interrupt Disabled.
     * |        |          |1 = Interrupt Enabled.
     * |[13]    |SRPDETIEN |SRP Detected Interrupt Enable Control
     * |        |          |0 = Interrupt Disabled.
     * |        |          |1 = Interrupt Enabled.
    */
    __IO uint32_t INTEN;

    /**
     * INTSTS
     * ===================================================================================================
     * Offset: 0x0C  OTG Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |ROLECHGIF |OTG Role Change Interrupt Status
     * |        |          |This flag is set when the role of an OTG device changed from a host to a peripheral, or changed from a peripheral to a host
     * |        |          |Note: Write 1 to clear this flag.
     * |[1]     |VBEIF     |VBUS Error Interrupt Status
     * |        |          |This flag will be set in one of two conditions
     * |        |          |l One case is that voltage on VBUS cannot reach a minimum valid threshold 4.4V within a maximum time of 100ms after OTG A device starting to drive.
     * |        |          |l The other case is that the supplied VBUS drops below a minimum valid threshold due to the overcurrent condition.
     * |        |          |Note: Write 1 to clear this flag and recover from the VBUS error state.
     * |[2]     |SRPFIF    |SRP Fail Interrupt Status
     * |        |          |After initiating SRP, an OTG B-device will wait at least TB_SRP_FAIL min, defined in OTG specification, for the OTG A-device respond This flag is set when the OTG B-device didn't get the response from the remote A-device to turn VBUS on and generate a bus reset.
     * |        |          |Note: Write 1 to clear this flag.
     * |[3]     |HNPFIF    |HNP Fail Interrupt Status
     * |        |          |When A-device has granted B-device to be host and USB bus in SE0 state, this bit will be set in specified interval (b_ase0_brst_tmr, defined in OTG spec.
     * |        |          |specification), A-device does not signal connect signal.
     * |        |          |Note: Write 1 to clear this flag.
     * |[4]     |GOIDLEIF  |OTG Device Goes IDLE Interrupt Status
     * |        |          |Flag is set if the OTG device transfers from non-idle state to idle state.
     * |        |          |The OTG device will be neither a host nor a peripheral.
     * |        |          |0 = OTG device does not go back to idle state(a_idle or b_idle).
     * |        |          |1 = OTG device go back to idle state(a_idle or b_idle).
     * |        |          |Note: Write 1 to clear this flag.
     * |[5]     |IDCHGIF   |ID State Change Interrupt Status
     * |        |          |0 = IDSTS not toggled.
     * |        |          |1 = IDSTS from high to low or from low to high.
     * |        |          |Note1: OTG_CTL[BUSREQ] will be cleared when IDDIG is high.
     * |        |          |Note2: Write 1 to clear this flag.
     * |[6]     |PDEVIF    |Act As Peripheral Interrupt Status
     * |        |          |0= This device does not act as a peripheral.
     * |        |          |1 = This device acts as a peripheral.
     * |        |          |Note: Write 1 to clear this flag.
     * |[7]     |HOSTIF    |Act As Host Interrupt Status
     * |        |          |0= This device does not act as a host.
     * |        |          |1 = This device acts as a host.
     * |        |          |Note: Write 1 to clear this flag.
     * |[8]     |BVLDCHGIF |B-Device Session Valid State Change Interrupt Status
     * |        |          |0 = BVLD not toggled.
     * |        |          |1 = BVLD from high to low or low to high.
     * |        |          |Note: Write 1 to clear this status.
     * |[9]     |AVLDCHGIF |A-Device Session Valid State Change Interrupt Status
     * |        |          |0 = AVLD not toggled.
     * |        |          |1 = AVLD from high to low or low to high.
     * |        |          |Note: Write 1 to clear this flag.
     * |[10]    |VBCHGIF   |VBVALID State Change Interrupt Status
     * |        |          |0 = VBUS_VLD not toggled.
     * |        |          |1 = VBUSVLD from high to low or from low to high.
     * |        |          |Note: Write 1 to clear this flag.
     * |[11]    |SECHGIF   |SESSEND State Change Interrupt Status
     * |        |          |0 = Session end not toggled.
     * |        |          |1 = SESSEND from high to low or from low to high.
     * |        |          |Note: Write 1 to clear this flag.
     * |[13]    |SRPDETIF  |SRP Detected Interrupt Status
     * |        |          |0 = SRP not detected.
     * |        |          |1 = SRP detected.
     * |        |          |Note: Write 1 to clear this status.
    */
    __IO uint32_t INTSTS;

    /**
     * STATUS
     * ===================================================================================================
     * Offset: 0x10  Functional Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |OVERCUR   |Over current Condition
     * |        |          |The voltage on VBUS cannot reach a minimum VBUS valid threshold, 4.4V minimum, within a maximum time of 100ms after OTG A device starting to drive
     * |        |          |0 = OTG A-device drives VBUS successfully.
     * |        |          |1 = Over current condition occurred.
     * |[1]     |IDSTS     |ID Pin State Of Mini-B/Micro-Plug
     * |        |          |0 = Mini-A/Micro-A plug is attached.
     * |        |          |1 = Mini-B/Micro-B plug is attached.
     * |[2]     |SESSEND   |Session End Status
     * |        |          |0 = VBUS > 0.8V.
     * |        |          |1 = VBUS < 0.2V.
     * |[3]     |BVLID     |B-Device Session Valid Status
     * |        |          |0 = VBUS < 0.8V.
     * |        |          |1 = VBUS > 4V.
     * |[4]     |AVLD      |A-Device Session Valid Status
     * |        |          |0 = VBUS < 0.8V.
     * |        |          |1 = VBUS > 2V.
     * |[5]     |VBUSVLD   |VBUS Valid Status
     * |        |          |0 = VBUS < 4.4V.
     * |        |          |1 = VBUS > 4.75V.
    */
    __I  uint32_t STATUS;

} OTG_T;

/**
    @addtogroup OTG_CONST OTG Bit Field Definition
    Constant Definitions for OTG Controller
@{ */

#define OTG_CTL_VBUSDROP_Pos             (0)                                               /*!< OTG_T::CTL: VBUSDROP Position             */
#define OTG_CTL_VBUSDROP_Msk             (0x1ul << OTG_CTL_VBUSDROP_Pos)                   /*!< OTG_T::CTL: VBUSDROP Mask                 */

#define OTG_CTL_BUSREQ_Pos               (1)                                               /*!< OTG_T::CTL: BUSREQ Position               */
#define OTG_CTL_BUSREQ_Msk               (0x1ul << OTG_CTL_BUSREQ_Pos)                     /*!< OTG_T::CTL: BUSREQ Mask                   */

#define OTG_CTL_HNPREQEN_Pos             (2)                                               /*!< OTG_T::CTL: HNPREQEN Position             */
#define OTG_CTL_HNPREQEN_Msk             (0x1ul << OTG_CTL_HNPREQEN_Pos)                   /*!< OTG_T::CTL: HNPREQEN Mask                 */

#define OTG_CTL_OTGEN_Pos                (4)                                               /*!< OTG_T::CTL: OTGEN Position                */
#define OTG_CTL_OTGEN_Msk                (0x1ul << OTG_CTL_OTGEN_Pos)                      /*!< OTG_T::CTL: OTGEN Mask                    */

#define OTG_CTL_PDEVCKON_Pos             (7)                                               /*!< OTG_T::CTL: PDEVCKON Position             */
#define OTG_CTL_PDEVCKON_Msk             (0x1ul << OTG_CTL_PDEVCKON_Pos)                   /*!< OTG_T::CTL: PDEVCKON Mask                 */

#define OTG_CTL_WKEN_Pos                 (8)                                               /*!< OTG_T::CTL: WKEN Position                 */
#define OTG_CTL_WKEN_Msk                 (0x1ul << OTG_CTL_WKEN_Pos)                       /*!< OTG_T::CTL: WKEN Mask                     */

#define OTG_PHYCTL_SWPDEN_Pos            (0)                                               /*!< OTG_T::PHYCTL: SWPDEN Position            */
#define OTG_PHYCTL_SWPDEN_Msk            (0x1ul << OTG_PHYCTL_SWPDEN_Pos)                  /*!< OTG_T::PHYCTL: SWPDEN Mask                */

#define OTG_PHYCTL_DPPDEN_Pos            (1)                                               /*!< OTG_T::PHYCTL: DPPDEN Position            */
#define OTG_PHYCTL_DPPDEN_Msk            (0x1ul << OTG_PHYCTL_DPPDEN_Pos)                  /*!< OTG_T::PHYCTL: DPPDEN Mask                */

#define OTG_PHYCTL_DMPDEN_Pos            (2)                                               /*!< OTG_T::PHYCTL: DMPDEN Position            */
#define OTG_PHYCTL_DMPDEN_Msk            (0x1ul << OTG_PHYCTL_DMPDEN_Pos)                  /*!< OTG_T::PHYCTL: DMPDEN Mask                */

#define OTG_PHYCTL_VBSTSPOL_Pos          (5)                                               /*!< OTG_T::PHYCTL: VBSTSPOL Position          */
#define OTG_PHYCTL_VBSTSPOL_Msk          (0x1ul << OTG_PHYCTL_VBSTSPOL_Pos)                /*!< OTG_T::PHYCTL: VBSTSPOL Mask              */

#define OTG_PHYCTL_VBENPOL_Pos           (6)                                               /*!< OTG_T::PHYCTL: VBUSPOL Position           */
#define OTG_PHYCTL_VBENPOL_Msk           (0x1ul << OTG_PHYCTL_VBENPOL_Pos)                 /*!< OTG_T::PHYCTL: VBUSPOL Mask               */

