MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
#define PDMA_DSCT_CTL_TXWIDTH_Pos        (12)                                              /*!< DSCT_T::CTL: TXWIDTH Position       */
#define PDMA_DSCT_CTL_TXWIDTH_Msk        (0x3ul << PDMA_DSCT_CTL_TXWIDTH_Pos)              /*!< DSCT_T::CTL: TXWIDTH Mask           */

#define PDMA_DSCT_CTL_TXCNT_Pos          (16)                                              /*!< DSCT_T::CTL: TXCNT Position         */
#define PDMA_DSCT_CTL_TXCNT_Msk          (0x3ffful << PDMA_DSCT_CTL_TXCNT_Pos)             /*!< DSCT_T::CTL: TXCNT Mask             */

#define PDMA_DSCT_ENDSA_ENDSA_Pos        (0)                                               /*!< DSCT_T::ENDSA: ENDSA Position       */
#define PDMA_DSCT_ENDSA_ENDSA_Msk        (0xfffffffful << PDMA_DSCT_ENDSA_ENDSA_Pos)       /*!< DSCT_T::ENDSA: ENDSA Mask           */

#define PDMA_DSCT_ENDDA_ENDDA_Pos        (0)                                               /*!< DSCT_T::ENDDA: ENDDA Position       */
#define PDMA_DSCT_ENDDA_ENDDA_Msk        (0xfffffffful << PDMA_DSCT_ENDDA_ENDDA_Pos)       /*!< DSCT_T::ENDDA: ENDDA Mask           */

#define PDMA_DSCT_NEXT_NEXT_Pos          (2)                                               /*!< DSCT_T::NEXT: NEXT Position         */
#define PDMA_DSCT_NEXT_NEXT_Msk          (0x3ffful << PDMA_DSCT_NEXT_NEXT_Pos)             /*!< DSCT_T::NEXT: NEXT Mask             */

#define PDMA_CHCTL_CHEN_Pos              (0)                                               /*!< PDMA_T::CHCTL: CHEN Position              */
#define PDMA_CHCTL_CHEN_Msk              (0xfffful << PDMA_CHCTL_CHEN_Pos)                 /*!< PDMA_T::CHCTL: CHEN Mask                  */

#define PDMA_STOP_STOP_Pos               (0)                                               /*!< PDMA_T::STOP: STOP Position               */
#define PDMA_STOP_STOP_Msk               (0xfffful << PDMA_STOP_STOP_Pos)                  /*!< PDMA_T::STOP: STOP Mask                   */

#define PDMA_SWREQ_SWREQ_Pos             (0)                                               /*!< PDMA_T::SWREQ: SWREQ Position             */
#define PDMA_SWREQ_SWREQ_Msk             (0xffful << PDMA_SWREQ_SWREQ_Pos)                 /*!< PDMA_T::SWREQ: SWREQ Mask                 */

#define PDMA_TRGSTS_REQSTS_Pos           (0)                                               /*!< PDMA_T::TRGSTS: REQSTS Position           */
#define PDMA_TRGSTS_REQSTS_Msk           (0xfffful << PDMA_TRGSTS_REQSTS_Pos)              /*!< PDMA_T::TRGSTS: REQSTS Mask               */

#define PDMA_PRISET_FPRISET_Pos          (0)                                               /*!< PDMA_T::PRISET: FPRISET Position          */
#define PDMA_PRISET_FPRISET_Msk          (0xfffful << PDMA_PRISET_FPRISET_Pos)             /*!< PDMA_T::PRISET: FPRISET Mask              */

#define PDMA_PRICLR_FPRICLR_Pos          (0)                                               /*!< PDMA_T::PRICLR: FPRICLR Position          */
#define PDMA_PRICLR_FPRICLR_Msk          (0xfffful << PDMA_PRICLR_FPRICLR_Pos)             /*!< PDMA_T::PRICLR: FPRICLR Mask              */

#define PDMA_INTEN_INTEN_Pos             (0)                                               /*!< PDMA_T::INTEN: INTEN Position             */
#define PDMA_INTEN_INTEN_Msk             (0xfffful << PDMA_INTEN_INTEN_Pos)                /*!< PDMA_T::INTEN: INTEN Mask                 */

#define PDMA_INTSTS_ABTIF_Pos            (0)                                               /*!< PDMA_T::INTSTS: ABTIF Position            */
#define PDMA_INTSTS_ABTIF_Msk            (0x1ul << PDMA_INTSTS_ABTIF_Pos)                  /*!< PDMA_T::INTSTS: ABTIF Mask                */

#define PDMA_INTSTS_TDIF_Pos             (1)                                               /*!< PDMA_T::INTSTS: TDIF Position             */
#define PDMA_INTSTS_TDIF_Msk             (0x1ul << PDMA_INTSTS_TDIF_Pos)                   /*!< PDMA_T::INTSTS: TDIF Mask                 */

#define PDMA_INTSTS_TEIF_Pos             (2)                                               /*!< PDMA_T::INTSTS: TEIF Position             */
#define PDMA_INTSTS_TEIF_Msk             (0x1ul << PDMA_INTSTS_TEIF_Pos)                   /*!< PDMA_T::INTSTS: TEIF Mask                 */

#define PDMA_ABTSTS_ABTIF_Pos            (0)                                               /*!< PDMA_T::ABTSTS: ABTIF Position            */
#define PDMA_ABTSTS_ABTIF_Msk            (0xfffful << PDMA_ABTSTS_ABTIF_Pos)               /*!< PDMA_T::ABTSTS: ABTIF Mask                */

#define PDMA_TDSTS_TDIF_Pos              (0)                                               /*!< PDMA_T::TDSTS: TDIF Position              */
#define PDMA_TDSTS_TDIF_Msk              (0xfffful << PDMA_TDSTS_TDIF_Pos)                 /*!< PDMA_T::TDSTS: TDIF Mask                  */

#define PDMA_SCATSTS_TEMPTYF_Pos         (0)                                               /*!< PDMA_T::SCATSTS: TEMPTYF Position         */
#define PDMA_SCATSTS_TEMPTYF_Msk         (0xfffful << PDMA_SCATSTS_TEMPTYF_Pos)            /*!< PDMA_T::SCATSTS: TEMPTYF Mask             */

#define PDMA_TACTSTS_TXACTF_Pos          (0)                                               /*!< PDMA_T::TACTSTS: TXACTF Position          */
#define PDMA_TACTSTS_TXACTF_Msk          (0xfffful << PDMA_TACTSTS_TXACTF_Pos)             /*!< PDMA_T::TACTSTS: TXACTF Mask              */

#define PDMA_SCATBA_SCATBA_Pos           (16)                                              /*!< PDMA_T::SCATBA: SCATBA Position           */
#define PDMA_SCATBA_SCATBA_Msk           (0xfffful << PDMA_SCATBA_SCATBA_Pos)              /*!< PDMA_T::SCATBA: SCATBA Mask               */

#define PDMA_REQSEL0_3_REQSRC0_Pos       (0)                                               /*!< PDMA_T::REQSEL0_3: REQSRC0 Position       */
#define PDMA_REQSEL0_3_REQSRC0_Msk       (0x1ful << PDMA_REQSEL0_3_REQSRC0_Pos)            /*!< PDMA_T::REQSEL0_3: REQSRC0 Mask           */

#define PDMA_REQSEL0_3_REQSRC1_Pos       (8)                                               /*!< PDMA_T::REQSEL0_3: REQSRC1 Position       */
#define PDMA_REQSEL0_3_REQSRC1_Msk       (0x1ful << PDMA_REQSEL0_3_REQSRC1_Pos)            /*!< PDMA_T::REQSEL0_3: REQSRC1 Mask           */

#define PDMA_REQSEL0_3_REQSRC2_Pos       (16)                                              /*!< PDMA_T::REQSEL0_3: REQSRC2 Position       */
#define PDMA_REQSEL0_3_REQSRC2_Msk       (0x1ful << PDMA_REQSEL0_3_REQSRC2_Pos)            /*!< PDMA_T::REQSEL0_3: REQSRC2 Mask           */

#define PDMA_REQSEL0_3_REQSRC3_Pos       (24)                                              /*!< PDMA_T::REQSEL0_3: REQSRC3 Position       */
#define PDMA_REQSEL0_3_REQSRC3_Msk       (0x1ful << PDMA_REQSEL0_3_REQSRC3_Pos)            /*!< PDMA_T::REQSEL0_3: REQSRC3 Mask           */

