MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
#define PWM_TRGADCTL_RTRGEN_Pos          (24)                                              /*!< PWM_T::TRGADCTL: RTRGEN Position          */
#define PWM_TRGADCTL_RTRGEN_Msk          (0x3ful << PWM_TRGADCTL_RTRGEN_Pos)               /*!< PWM_T::TRGADCTL: RTRGEN Mask              */

#define PWM_TRGADCSTS_PTRGF_Pos          (0)                                               /*!< PWM_T::TRGADCSTS: PTRGF Position          */
#define PWM_TRGADCSTS_PTRGF_Msk          (0x3ful << PWM_TRGADCSTS_PTRGF_Pos)               /*!< PWM_T::TRGADCSTS: PTRGF Mask              */

#define PWM_TRGADCSTS_CTRGF_Pos          (8)                                               /*!< PWM_T::TRGADCSTS: CTRGF Position          */
#define PWM_TRGADCSTS_CTRGF_Msk          (0x3ful << PWM_TRGADCSTS_CTRGF_Pos)               /*!< PWM_T::TRGADCSTS: CTRGF Mask              */

#define PWM_TRGADCSTS_FTRGF_Pos          (16)                                              /*!< PWM_T::TRGADCSTS: FTRGF Position          */
#define PWM_TRGADCSTS_FTRGF_Msk          (0x3ful << PWM_TRGADCSTS_FTRGF_Pos)               /*!< PWM_T::TRGADCSTS: FTRGF Mask              */

#define PWM_TRGADCSTS_RTRGF_Pos          (24)                                              /*!< PWM_T::TRGADCSTS: RTRGF Position          */
#define PWM_TRGADCSTS_RTRGF_Msk          (0x3ful << PWM_TRGADCSTS_RTRGF_Pos)               /*!< PWM_T::TRGADCSTS: RTRGF Mask              */

#define PWM_BRKCTL_BRK0EN_Pos            (0)                                               /*!< PWM_T::BRKCTL: BRK0EN Position           */
#define PWM_BRKCTL_BRK0EN_Msk            (0x1ul << PWM_BRKCTL_BRK0EN_Pos)                  /*!< PWM_T::BRKCTL: BRK0EN Mask               */

#define PWM_BRKCTL_BRK0NFDIS_Pos         (1)                                               /*!< PWM_T::BRKCTL: BRK0NFDIS Position         */
#define PWM_BRKCTL_BRK0NFDIS_Msk         (0x1ul << PWM_BRKCTL_BRK0NFDIS_Pos)               /*!< PWM_T::BRKCTL: BRK0NFDIS Mask             */

#define PWM_BRKCTL_BRK0INV_Pos           (2)                                               /*!< PWM_T::BRKCTL: BRK0INV Position           */
#define PWM_BRKCTL_BRK0INV_Msk           (0x1ul << PWM_BRKCTL_BRK0INV_Pos)                 /*!< PWM_T::BRKCTL: BRK0INV Mask               */

#define PWM_BRKCTL_BRK0NFSEL_Pos         (6)                                               /*!< PWM_T::BRKCTL: BRK0NFSEL Position         */
#define PWM_BRKCTL_BRK0NFSEL_Msk         (0x3ul << PWM_BRKCTL_BRK0NFSEL_Pos)               /*!< PWM_T::BRKCTL: BRK0NFSEL Mask             */

#define PWM_BRKCTL_BRK1EN_Pos            (8)                                               /*!< PWM_T::BRKCTL: BRK1EN Position           */
#define PWM_BRKCTL_BRK1EN_Msk            (0x1ul << PWM_BRKCTL_BRK1EN_Pos)                  /*!< PWM_T::BRKCTL: BRK1EN Mask               */

#define PWM_BRKCTL_BRK1NFDIS_Pos         (9)                                               /*!< PWM_T::BRKCTL: BRK1NFDIS Position         */
#define PWM_BRKCTL_BRK1NFDIS_Msk         (0x1ul << PWM_BRKCTL_BRK1NFDIS_Pos)               /*!< PWM_T::BRKCTL: BRK1NFDIS Mask             */

#define PWM_BRKCTL_BRK1INV_Pos           (10)                                              /*!< PWM_T::BRKCTL: BRK1INV Position           */
#define PWM_BRKCTL_BRK1INV_Msk           (0x1ul << PWM_BRKCTL_BRK1INV_Pos)                 /*!< PWM_T::BRKCTL: BRK1INV Mask               */

#define PWM_BRKCTL_BK1SEL_Pos            (12)                                              /*!< PWM_T::BRKCTL: BK1SEL Position            */
#define PWM_BRKCTL_BK1SEL_Msk            (0x3ul << PWM_BRKCTL_BK1SEL_Pos)                  /*!< PWM_T::BRKCTL: BK1SEL Mask                */

#define PWM_BRKCTL_BRK1NFSEL_Pos         (14)                                              /*!< PWM_T::BRKCTL: BRK1NFSEL Position         */
#define PWM_BRKCTL_BRK1NFSEL_Msk         (0x3ul << PWM_BRKCTL_BRK1NFSEL_Pos)               /*!< PWM_T::BRKCTL: BRK1NFSEL Mask             */

#define PWM_BRKCTL_CPO0BKEN_Pos          (16)                                              /*!< PWM_T::BRKCTL: CPO0BKEN Position          */
#define PWM_BRKCTL_CPO0BKEN_Msk          (0x1ul << PWM_BRKCTL_CPO0BKEN_Pos)                /*!< PWM_T::BRKCTL: CPO0BKEN Mask              */

#define PWM_BRKCTL_CPO1BKEN_Pos          (17)                                              /*!< PWM_T::BRKCTL: CPO1BKEN Position          */
#define PWM_BRKCTL_CPO1BKEN_Msk          (0x1ul << PWM_BRKCTL_CPO1BKEN_Pos)                /*!< PWM_T::BRKCTL: CPO1BKEN Mask              */

#define PWM_BRKCTL_CPO2BKEN_Pos          (18)                                              /*!< PWM_T::BRKCTL: CPO2BKEN Position          */
#define PWM_BRKCTL_CPO2BKEN_Msk          (0x1ul << PWM_BRKCTL_CPO2BKEN_Pos)                /*!< PWM_T::BRKCTL: CPO2BKEN Mask              */

#define PWM_BRKCTL_LVDBKEN_Pos           (19)                                              /*!< PWM_T::BRKCTL: LVDBKEN Position           */
#define PWM_BRKCTL_LVDBKEN_Msk           (0x1ul << PWM_BRKCTL_LVDBKEN_Pos)                 /*!< PWM_T::BRKCTL: LVDBKEN Mask               */

#define PWM_BRKCTL_BKOD_Pos              (24)                                              /*!< PWM_T::BRKCTL: BKOD Position              */
#define PWM_BRKCTL_BKOD_Msk              (0x3ful << PWM_BRKCTL_BKOD_Pos)                   /*!< PWM_T::BRKCTL: BKOD Mask                  */

#define PWM_INTCTL_PINTTYPE_Pos          (0)                                               /*!< PWM_T::INTCTL: PINTTYPE Position          */
#define PWM_INTCTL_PINTTYPE_Msk          (0x3ful << PWM_INTCTL_PINTTYPE_Pos)               /*!< PWM_T::INTCTL: PINTTYPE Mask              */

#define PWM_INTCTL_DINTTYPE_Pos          (8)                                               /*!< PWM_T::INTCTL: DINTTYPE Position          */
#define PWM_INTCTL_DINTTYPE_Msk          (0x3ful << PWM_INTCTL_DINTTYPE_Pos)               /*!< PWM_T::INTCTL: DINTTYPE Mask              */

#define PWM_INTEN_PIEN_Pos               (0)                                               /*!< PWM_T::INTEN: PIEN Position               */
#define PWM_INTEN_PIEN_Msk               (0x3ful << PWM_INTEN_PIEN_Pos)                    /*!< PWM_T::INTEN: PIEN Mask                   */

#define PWM_INTEN_BRKIEN_Pos             (6)                                               /*!< PWM_T::INTEN: BRKIEN Position             */
#define PWM_INTEN_BRKIEN_Msk             (0x1ul << PWM_INTEN_BRKIEN_Pos)                   /*!< PWM_T::INTEN: BRKIEN Mask                 */

