MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
#define PWM_INTEN_DIEN_Pos               (8)                                               /*!< PWM_T::INTEN: DIEN Position               */
#define PWM_INTEN_DIEN_Msk               (0x3ful << PWM_INTEN_DIEN_Pos)                    /*!< PWM_T::INTEN: DIEN Mask                   */

#define PWM_INTEN_RLIEN_Pos              (16)                                              /*!< PWM_T::INTEN: RLIEN Position              */
#define PWM_INTEN_RLIEN_Msk              (0x3ful << PWM_INTEN_RLIEN_Pos)                   /*!< PWM_T::INTEN: RLIEN Mask                  */

#define PWM_INTEN_FLIEN_Pos              (24)                                              /*!< PWM_T::INTEN: FLIEN Position              */
#define PWM_INTEN_FLIEN_Msk              (0x3ful << PWM_INTEN_FLIEN_Pos)                   /*!< PWM_T::INTEN: FLIEN Mask                  */

#define PWM_INTSTS_PIF_Pos               (0)                                               /*!< PWM_T::INTSTS: PIF Position               */
#define PWM_INTSTS_PIF_Msk               (0x3ful << PWM_INTSTS_PIF_Pos)                    /*!< PWM_T::INTSTS: PIF Mask                   */

#define PWM_INTSTS_BRKIF0_Pos            (6)                                               /*!< PWM_T::INTSTS: BRKIF0 Position            */
#define PWM_INTSTS_BRKIF0_Msk            (0x1ul << PWM_INTSTS_BRKIF0_Pos)                  /*!< PWM_T::INTSTS: BRKIF0 Mask                */

#define PWM_INTSTS_BRKIF1_Pos            (7)                                               /*!< PWM_T::INTSTS: BRKIF1 Position            */
#define PWM_INTSTS_BRKIF1_Msk            (0x1ul << PWM_INTSTS_BRKIF1_Pos)                  /*!< PWM_T::INTSTS: BRKIF1 Mask                */

#define PWM_INTSTS_DIF_Pos               (8)                                               /*!< PWM_T::INTSTS: DIF Position               */
#define PWM_INTSTS_DIF_Msk               (0x3ful << PWM_INTSTS_DIF_Pos)                    /*!< PWM_T::INTSTS: DIF Mask                   */

#define PWM_INTSTS_BRKLK0_Pos            (14)                                              /*!< PWM_T::INTSTS: BRKLK0 Position            */
#define PWM_INTSTS_BRKLK0_Msk            (0x1ul << PWM_INTSTS_BRKLK0_Pos)                  /*!< PWM_T::INTSTS: BRKLK0 Mask                */

#define PWM_INTSTS_CRLIF_Pos             (16)                                              /*!< PWM_T::INTSTS: CRLIF Position             */
#define PWM_INTSTS_CRLIF_Msk             (0x3ful << PWM_INTSTS_CRLIF_Pos)                  /*!< PWM_T::INTSTS: CRLIF Mask                 */

#define PWM_INTSTS_BRKSTS0_Pos           (22)                                              /*!< PWM_T::INTSTS: BRKSTS0 Position           */
#define PWM_INTSTS_BRKSTS0_Msk           (0x1ul << PWM_INTSTS_BRKSTS0_Pos)                 /*!< PWM_T::INTSTS: BRKSTS0 Mask               */

#define PWM_INTSTS_BRKSTS1_Pos           (23)                                              /*!< PWM_T::INTSTS: BRKSTS1 Position           */
#define PWM_INTSTS_BRKSTS1_Msk           (0x1ul << PWM_INTSTS_BRKSTS1_Pos)                 /*!< PWM_T::INTSTS: BRKSTS1 Mask               */

#define PWM_INTSTS_CFLIF_Pos             (24)                                              /*!< PWM_T::INTSTS: CFLIF Position             */
#define PWM_INTSTS_CFLIF_Msk             (0x3ful << PWM_INTSTS_CFLIF_Pos)                  /*!< PWM_T::INTSTS: CFLIF Mask                 */

#define PWM_POEN_POEN_Pos                (0)                                               /*!< PWM_T::POEN: POEN Position                */
#define PWM_POEN_POEN_Msk                (0x3ful << PWM_POEN_POEN_Pos)                     /*!< PWM_T::POEN: POEN Mask                    */

#define PWM_CAPCTL_CAPEN_Pos             (0)                                               /*!< PWM_T::CAPCTL: CAPEN Position             */
#define PWM_CAPCTL_CAPEN_Msk             (0x3ful << PWM_CAPCTL_CAPEN_Pos)                  /*!< PWM_T::CAPCTL: CAPEN Mask                 */

#define PWM_CAPCTL_CAPINV_Pos            (8)                                               /*!< PWM_T::CAPCTL: CAPINV Position            */
#define PWM_CAPCTL_CAPINV_Msk            (0x3ful << PWM_CAPCTL_CAPINV_Pos)                 /*!< PWM_T::CAPCTL: CAPINV Mask                */

#define PWM_CAPCTL_RCRLDEN_Pos           (16)                                              /*!< PWM_T::CAPCTL: RCRLDEN Position           */
#define PWM_CAPCTL_RCRLDEN_Msk           (0x3ful << PWM_CAPCTL_RCRLDEN_Pos)                /*!< PWM_T::CAPCTL: RCRLDEN Mask               */

#define PWM_CAPCTL_FCRLDEN_Pos           (24)                                              /*!< PWM_T::CAPCTL: FCRLDEN Position           */
#define PWM_CAPCTL_FCRLDEN_Msk           (0x3ful << PWM_CAPCTL_FCRLDEN_Pos)                /*!< PWM_T::CAPCTL: FCRLDEN Mask               */

#define PWM_CAPINEN_CAPINEN_Pos          (0)                                               /*!< PWM_T::CAPINEN: CAPINEN Position          */
#define PWM_CAPINEN_CAPINEN_Msk          (0x3ful << PWM_CAPINEN_CAPINEN_Pos)               /*!< PWM_T::CAPINEN: CAPINEN Mask              */

#define PWM_CAPSTS_CRIFOV_Pos            (0)                                               /*!< PWM_T::CAPSTS: CRIFOV Position            */
#define PWM_CAPSTS_CRIFOV_Msk            (0x3ful << PWM_CAPSTS_CRIFOV_Pos)                 /*!< PWM_T::CAPSTS: CRIFOV Mask                */

#define PWM_CAPSTS_FLIFOV_Pos            (8)                                               /*!< PWM_T::CAPSTS: FLIFOV Position            */
#define PWM_CAPSTS_FLIFOV_Msk            (0x3ful << PWM_CAPSTS_FLIFOV_Pos)                 /*!< PWM_T::CAPSTS: FLIFOV Mask                */

#define PWM_RCAPDAT0_RCAPDAT_Pos         (0)                                               /*!< PWM_T::RCAPDAT0: RCAPDAT Position         */
#define PWM_RCAPDAT0_RCAPDAT_Msk         (0xfffful << PWM_RCAPDAT0_RCAPDAT_Pos)            /*!< PWM_T::RCAPDAT0: RCAPDAT Mask             */

#define PWM_FCAPDAT0_FCAPDAT_Pos         (0)                                               /*!< PWM_T::FCAPDAT0: FCAPDAT Position         */
#define PWM_FCAPDAT0_FCAPDAT_Msk         (0xfffful << PWM_FCAPDAT0_FCAPDAT_Pos)            /*!< PWM_T::FCAPDAT0: FCAPDAT Mask             */

