MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
    /**
     * BODCTL
     * ===================================================================================================
     * Offset: 0x18  Brown-out Detector Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |BODEN     |Brown-Out Detector Enable Control (Write Protect)
     * |        |          |The default value is set by flash controller user configuration register config0 bit[23]
     * |        |          |0 = Brown-out Detector function Disabled.
     * |        |          |1 = Brown-out Detector function Enabled.
     * |        |          |This bit is the protected bit, which means programming this needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register SYS_REGLCTL at address GCR_BA+0x100.
     * |[1:2]   |BODVL     |Brown-Out Detector Threshold Voltage Selection (Write Protect)
     * |        |          |The default value is set by flash controller user configuration register config0 bit[22:21]
     * |        |          |Relationship between BODVL and Brown-out voltage listed below:
     * |        |          |00 = 2.2V.
     * |        |          |01 = 2.7V.
     * |        |          |10 = 3.8V.
     * |        |          |11 = 4.5V.
     * |        |          |This bit is the protected bit, which means programming this needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register SYS_REGLCTL at address GCR_BA+0x100.
     * |[3]     |BODRSTEN  |Brown-Out Reset Enable Control (Write Protect)
     * |        |          |While the Brown-out Detector function is enabled (BODEN high) and BOD reset function is enabled (BODRSTEN high), BOD will assert a signal to reset chip when the detected voltage is lower than the threshold (BODOUT high).
     * |        |          |While the BOD function is enabled (BODEN high) and BOD interrupt function is enabled (BODRSTEN low), BOD will assert an interrupt if BODOUT is high.
     * |        |          |BOD interrupt will keep till to the BODEN set to 0.
     * |        |          |BOD interrupt can be blocked by disabling the NVIC BOD interrupt or disabling BOD function (set BODEN low).
     * |        |          |The default value is set by flash controller user configuration register config0 bit[20].
     * |        |          |0 = Brown-out "INTERRUPT" function Enabled.
     * |        |          |1 = Brown-out "RESET" function Enabled.
     * |        |          |This bit is the protected bit, which means programming this needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register SYS_REGLCTL at address GCR_BA+0x100.
     * |[4]     |BODINTF   |Brown-Out Detector Interrupt Flag
     * |        |          |0 = Brown-out Detector does not detect any voltage draft at VDD down through or up through the voltage of BODVL setting.
     * |        |          |1 = When Brown-out Detector detects the VDD is dropped down through the voltage of BODVL setting or the VDD is raised up through the voltage of BODVL setting, this bit is set to 1 and the brown-out interrupt is requested if brown-out interrupt is enabled.
     * |        |          |Note: Write 1 to clear this bit to 0.
     * |[5]     |BODLPM    |Brown-Out Detector Low Power Mode (Write Protect)
     * |        |          |The BOD consumes about 100uA in normal mode, the low power mode can reduce the current to about 1/10 but slow the BOD response.
     * |        |          |0 = BOD operate in normal mode (default).
     * |        |          |1 = BOD Low Power mode Enabled.
     * |        |          |This bit is the protected bit, which means programming this needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register SYS_REGLCTL at address GCR_BA+0x100.
     * |[6]     |BODOUT    |Brown-Out Detector Output Status
     * |        |          |0 = Brown-out Detector output status is 0.
     * |        |          |It means the detected voltage is higher than BODVL setting or BODEN is 0.
     * |        |          |1 = Brown-out Detector output status is 1.
     * |        |          |It means the detected voltage is lower than BODVL setting.
     * |        |          |If the BODEN is 0, BOD function disabled , this bit always responds 0000.
     * |[7]     |LVREN     |Low Voltage Reset Enable Control (Write Protect)
     * |        |          |The LVR function reset the chip when the input power voltage is lower than LVR circuit setting.
     * |        |          |LVR function is enabled in default.
     * |        |          |0 = Low Voltage Reset function Disabled.
     * |        |          |1 = Low Voltage Reset function Enabled - After enabling the bit, the LVR function will be active with 100uS delay for LVR output stable (default).
     * |        |          |This bit is the protected bit, which means programming this needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register SYS_REGLCTL at address GCR_BA+0x100.
    */
    __IO uint32_t BODCTL;

    /**
     * TEMPCTL
     * ===================================================================================================
     * Offset: 0x1C  Temperature Sensor Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |VTEMPEN   |Temperature Sensor Enable Control
     * |        |          |This bit is used to enable/disable temperature sensor function.
     * |        |          |0 = Temperature sensor function Disabled (default).
     * |        |          |1 = Temperature sensor function Enabled.
     * |        |          |After this bit is set to 1, the value of temperature sensor output can be obtained from ADC conversion result.
     * |        |          |Please refer to ADC function chapter for details.
    */
    __IO uint32_t TEMPCTL;

    /**
     * VCID
     * ===================================================================================================
     * Offset: 0x20  Hardware Version Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |VCID      |Hardware Version Control (Ready Only)
     * |        |          |These registers repress hardware version.
     * |        |          |These bits are the read protected bits.
     * |        |          |It means programming this needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register SYS_REGLCTL at address GCR_BA+0x100.
    */
    __I  uint32_t VCID;

    /**
     * PORCTL
     * ===================================================================================================
     * Offset: 0x24  Power-On-Reset Controller Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:15]  |POROFF    |Power-On-Reset Enable Control (Write Protect)
     * |        |          |When power on, the POR circuit generates a reset signal to reset the whole chip function, but noise on the power may cause the POR active again.
     * |        |          |User can disable internal POR circuit to avoid unpredictable noise to cause chip reset by writing 0x5AA5 to this field.
     * |        |          |The POR function will be active again when this field is set to another value or chip is reset by other reset source, including:
     * |        |          |/RESET, Watch dog, LVR reset, BOD reset, ICE reset command and the software-chip reset function
     * |        |          |This bit is the protected bit, which means programming this needs to write "59h", "16h", "88h" to address 0x4000_0100 to disable register protection.
     * |        |          |Refer to the register SYS_REGLCTL at address GCR_BA+0x100.
    */
    __IO uint32_t PORCTL;

    /**
     * VREFCTL
     * ===================================================================================================
     * Offset: 0x28  ADC VREF Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:4]   |VREFCTL   |Vref control bits (Write Protect)
     * |        |          |00011=Vref is internal 2.65V
     * |        |          |00111=Vref is internal 2.048V
     * |        |          |01011=Vref is internal 3.072V
     * |        |          |01111=Vref is internal 4.096V
     * |        |          |10000=Vref is from AVDD
     * |        |          |Others=Reserved
     * |[8]     |ADCMODESEL|ADC IP Selection (Write Protect)
     * |        |          |0 = ADC mode.
     * |        |          |1 = E ADC mode.
     * |[9]     |PWMSYNCMODE|PWM SYNC MODE (Write Protect)
     * |        |          |0 = PWM SYNC MODE Disabled; PWM engine clock can different with HCLK.
     * |        |          |1 = PWM SYNC MODE Enabled; PWM engine clock is same as HCLK.
    */
    __IO uint32_t VREFCTL;

    /**
     * USBPHY
     * ===================================================================================================
     * Offset: 0x2C  USB PHY Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:1]   |USBROLE   |USB Role Configuration (Write Protect)
     * |        |          |USB role configuration can be from ROMMAP or software setting if software setting option, controlled by ROMMAP, is enabled.
     * |        |          |00 = Standard USB device.
     * |        |          |01 = Standard USB host.
     * |        |          |10 = ID dependent device.
     * |        |          |11 = On-The-Go device.
     * |[8]     |LDO33EN   |LDO33 Enable Control (Write Protect)
     * |        |          |0 = USB LDO33 Disabled.
     * |        |          |1 = USB LDO33 Enabled.
    */
    __IO uint32_t USBPHY;

    /**
     * GPA_MFPL
     * ===================================================================================================
     * Offset: 0x30  Port A Low Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PA0MFP    |PA.0 Multi-function Pin Selection
     * |[4:7]   |PA1MFP    |PA.1 Multi-function Pin Selection
     * |[8:11]  |PA2MFP    |PA.2 Multi-function Pin Selection
     * |[12:15] |PA3MFP    |PA.3 Multi-function Pin Selection
     * |[16:19] |PA4MFP    |PA.4 Multi-function Pin Selection
     * |[20:23] |PA5MFP    |PA.5 Multi-function Pin Selection
     * |[24:27] |PA6MFP    |PA.6 Multi-function Pin Selection
     * |[28:31] |PA7MFP    |PA.7 Multi-function Pin Selection
    */
    __IO uint32_t GPA_MFPL;

    /**
     * GPA_MFPH
     * ===================================================================================================
     * Offset: 0x34  Port A High Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PA8MFP    |PA.8 Multi-function Pin Selection
     * |[4:7]   |PA9MFP    |PA.9 Multi-function Pin Selection
     * |[8:11]  |PA10MFP   |PA.10 Multi-function Pin Selection
     * |[12:15] |PA11MFP   |PA.11 Multi-function Pin Selection
     * |[16:19] |PA12MFP   |PA.12 Multi-function Pin Selection
     * |[20:23] |PA13MFP   |PA.13 Multi-function Pin Selection
     * |[24:27] |PA14MFP   |PA.14 Multi-function Pin Selection
     * |[28:31] |PA15MFP   |PA.15 Multi-function Pin Selection
    */
    __IO uint32_t GPA_MFPH;

    /**
     * GPB_MFPL
     * ===================================================================================================
     * Offset: 0x38  Port B Low Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PB0MFP    |PB.0 Multi-function Pin Selection
     * |[4:7]   |PB1MFP    |PB.1 Multi-function Pin Selection
     * |[8:11]  |PB2MFP    |PB.2 Multi-function Pin Selection
     * |[12:15] |PB3MFP    |PB.3 Multi-function Pin Selection
     * |[16:19] |PB4MFP    |PB.4 Multi-function Pin Selection
     * |[20:23] |PB5MFP    |PB.5 Multi-function Pin Selection
     * |[24:27] |PB6MFP    |PB.6 Multi-function Pin Selection
     * |[28:31] |PB7MFP    |PB.7 Multi-function Pin Selection
    */
    __IO uint32_t GPB_MFPL;

    /**
     * GPB_MFPH
     * ===================================================================================================
     * Offset: 0x3C  Port B High Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PB8MFP    |PB.8 Multi-function Pin Selection
     * |[4:7]   |PB9MFP    |PB.9 Multi-function Pin Selection
     * |[8:11]  |PB10MFP   |PB.10 Multi-function Pin Selection
     * |[12:15] |PB11MFP   |PB.11 Multi-function Pin Selection
     * |[16:19] |PB12MFP   |PB.12 Multi-function Pin Selection
     * |[20:23] |PB13MFP   |PB.13 Multi-function Pin Selection
     * |[24:27] |PB14MFP   |PB.14 Multi-function Pin Selection
     * |[28:31] |PB15MFP   |PB.15 Multi-function Pin Selection
    */
    __IO uint32_t GPB_MFPH;

    /**
     * GPC_MFPL
     * ===================================================================================================
     * Offset: 0x40  Port C Low Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PC0MFP    |PC.0 Multi-function Pin Selection
     * |[4:7]   |PC1MFP    |PC.1 Multi-function Pin Selection
     * |[8:11]  |PC2MFP    |PC.2 Multi-function Pin Selection
     * |[12:15] |PC3MFP    |PC.3 Multi-function Pin Selection
     * |[16:19] |PC4MFP    |PC.4 Multi-function Pin Selection
     * |[20:23] |PC5MFP    |PC.5 Multi-function Pin Selection
     * |[24:27] |PC6MFP    |PC.6 Multi-function Pin Selection
     * |[28:31] |PC7MFP    |PC.7 Multi-function Pin Selection
    */
    __IO uint32_t GPC_MFPL;

    /**
     * GPC_MFPH
     * ===================================================================================================
     * Offset: 0x44  Port C High Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PC8MFP    |PC.8 Multi-function Pin Selection
     * |[4:7]   |PC9MFP    |PC.9 Multi-function Pin Selection
     * |[8:11]  |PC10MFP   |PC.10 Multi-function Pin Selection
     * |[12:15] |PC11MFP   |PC.11 Multi-function Pin Selection
     * |[16:19] |PC12MFP   |PC.12 Multi-function Pin Selection
     * |[20:23] |PC13MFP   |PC.13 Multi-function Pin Selection
     * |[24:27] |PC14MFP   |PC.14 Multi-function Pin Selection
     * |[28:31] |PC15MFP   |PC.15 Multi-function Pin Selection
    */
    __IO uint32_t GPC_MFPH;

    /**
     * GPD_MFPL
     * ===================================================================================================
     * Offset: 0x48  Port D Low Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PD0MFP    |PD.0 Multi-function Pin Selection
     * |[4:7]   |PD1MFP    |PD.1 Multi-function Pin Selection
     * |[8:11]  |PD2MFP    |PD.2 Multi-function Pin Selection
     * |[12:15] |PD3MFP    |PD.3 Multi-function Pin Selection
     * |[16:19] |PD4MFP    |PD.4 Multi-function Pin Selection
     * |[20:23] |PD5MFP    |PD.5 Multi-function Pin Selection
     * |[24:27] |PD6MFP    |PD.6 Multi-function Pin Selection
     * |[28:31] |PD7MFP    |PD.7 Multi-function Pin Selection
    */
    __IO uint32_t GPD_MFPL;

    /**
     * GPD_MFPH
     * ===================================================================================================
     * Offset: 0x4C  Port D High Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PD8MFP    |PD.8 Multi-function Pin Selection
     * |[4:7]   |PD9MFP    |PD.9 Multi-function Pin Selection
     * |[8:11]  |PD10MFP   |PD.10 Multi-function Pin Selection
     * |[12:15] |PD11MFP   |PD.11 Multi-function Pin Selection
     * |[16:19] |PD12MFP   |PD.12 Multi-function Pin Selection
     * |[20:23] |PD13MFP   |PD.13 Multi-function Pin Selection
     * |[24:27] |PD14MFP   |PD.14 Multi-function Pin Selection
     * |[28:31] |PD15MFP   |PD.15 Multi-function Pin Selection
    */
    __IO uint32_t GPD_MFPH;

    /**
     * GPE_MFPL
     * ===================================================================================================
     * Offset: 0x50  Port E Low Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PE0MFP    |PE.0 Multi-function Pin Selection
     * |[4:7]   |PE1MFP    |PE.1 Multi-function Pin Selection
     * |[8:11]  |PE2MFP    |PE.2 Multi-function Pin Selection
     * |[12:15] |PE3MFP    |PE.3 Multi-function Pin Selection
     * |[16:19] |PE4MFP    |PE.4 Multi-function Pin Selection
     * |[20:23] |PE5MFP    |PE.5 Multi-function Pin Selection
     * |[24:27] |PE6MFP    |PE.6 Multi-function Pin Selection
     * |[28:31] |PE7MFP    |PE.7 Multi-function Pin Selection
    */
    __IO uint32_t GPE_MFPL;

    /**
     * GPE_MFPH
     * ===================================================================================================
     * Offset: 0x54  Port E High Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PE8MFP    |PE.8 Multi-function Pin Selection
     * |[4:7]   |PE9MFP    |PE.9 Multi-function Pin Selection
     * |[8:11]  |PE10MFP   |PE.10 Multi-function Pin Selection
     * |[12:15] |PE11MFP   |PE.11 Multi-function Pin Selection
     * |[16:19] |PE12MFP   |PE.12 Multi-function Pin Selection
     * |[20:23] |PE13MFP   |PE.13 Multi-function Pin Selection
     * |[24:27] |PE14MFP   |PE.14 Multi-function Pin Selection
     * |[28:31] |PE15MFP   |PE.15 Multi-function Pin Selection
    */
    __IO uint32_t GPE_MFPH;

    /**
     * GPF_MFPL
     * ===================================================================================================
     * Offset: 0x58  Port F Low Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PF0MFP    |PF.0 Multi-function Pin Selection
     * |[4:7]   |PF1MFP    |PF.1 Multi-function Pin Selection
     * |[8:11]  |PF2MFP    |PF.2 Multi-function Pin Selection
     * |[12:15] |PF3MFP    |PF.3 Multi-function Pin Selection
     * |[16:19] |PF4MFP    |PF.4 Multi-function Pin Selection
     * |[20:23] |PF5MFP    |PF.5 Multi-function Pin Selection
     * |[24:27] |PF6MFP    |PF.6 Multi-function Pin Selection
     * |[28:31] |PF7MFP    |PF.7 Multi-function Pin Selection
    */
    __IO uint32_t GPF_MFPL;

    /**
     * GPF_MFPH
     * ===================================================================================================
     * Offset: 0x5C  Port F High Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PF8MFP    |PF.8 Multi-function Pin Selection
     * |[4:7]   |PF9MFP    |PF.9 Multi-function Pin Selection
     * |[8:11]  |PF10MFP   |PF.10 Multi-function Pin Selection
     * |[12:15] |PF11MFP   |PF.11 Multi-function Pin Selection
     * |[16:19] |PF12MFP   |PF.12 Multi-function Pin Selection
     * |[20:23] |PF13MFP   |PF.13 Multi-function Pin Selection
     * |[24:27] |PF14MFP   |PF.14 Multi-function Pin Selection
     * |[28:31] |PF15MFP   |PF.15 Multi-function Pin Selection
    */
    __IO uint32_t GPF_MFPH;

    /**
     * GPG_MFPL
     * ===================================================================================================
     * Offset: 0x60  Port G Low Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PG0MFP    |PG.0 Multi-function Pin Selection
     * |[4:7]   |PG1MFP    |PG.1 Multi-function Pin Selection
     * |[8:11]  |PG2MFP    |PG.2 Multi-function Pin Selection
     * |[12:15] |PG3MFP    |PG.3 Multi-function Pin Selection
     * |[16:19] |PG4MFP    |PG.4 Multi-function Pin Selection
     * |[20:23] |PG5MFP    |PG.5 Multi-function Pin Selection
     * |[24:27] |PG6MFP    |PG.6 Multi-function Pin Selection
     * |[28:31] |PG7MFP    |PG.7 Multi-function Pin Selection
    */
    __IO uint32_t GPG_MFPL;

    /**
     * GPG_MFPH
     * ===================================================================================================
     * Offset: 0x64  Port G High Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PG8MFP    |PG.8 Multi-function Pin Selection
     * |[4:7]   |PG9MFP    |PG.9 Multi-function Pin Selection
     * |[8:11]  |PG10MFP   |PG.10 Multi-function Pin Selection
     * |[12:15] |PG11MFP   |PG.11 Multi-function Pin Selection
     * |[16:19] |PG12MFP   |PG.12 Multi-function Pin Selection
     * |[20:23] |PG13MFP   |PG.13 Multi-function Pin Selection
     * |[24:27] |PG14MFP   |PG.14 Multi-function Pin Selection
     * |[28:31] |PG15MFP   |PG.15 Multi-function Pin Selection
    */
    __IO uint32_t GPG_MFPH;

