MikroElektronika/core_packages/ARM/gcc_clang/def/nuvoton/NUC442RI8AE/mcu.h
    /**
     * GPH_MFPL
     * ===================================================================================================
     * Offset: 0x68  Port H Low Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PH0MFP    |PH.0 Multi-function Pin Selection
     * |[4:7]   |PH1MFP    |PH.1 Multi-function Pin Selection
     * |[8:11]  |PH2MFP    |PH.2 Multi-function Pin Selection
     * |[12:15] |PH3MFP    |PH.3 Multi-function Pin Selection
     * |[16:19] |PH4MFP    |PH.4 Multi-function Pin Selection
     * |[20:23] |PH5MFP    |PH.5 Multi-function Pin Selection
     * |[24:27] |PH6MFP    |PH.6 Multi-function Pin Selection
     * |[28:31] |PH7MFP    |PH.7 Multi-function Pin Selection
    */
    __IO uint32_t GPH_MFPL;

    /**
     * GPH_MFPH
     * ===================================================================================================
     * Offset: 0x6C  Port H High Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PH8MFP    |PH.8 Multi-function Pin Selection
     * |[4:7]   |PH9MFP    |PH.9 Multi-function Pin Selection
     * |[8:11]  |PH10MFP   |PH.10 Multi-function Pin Selection
     * |[12:15] |PH11MFP   |PH.11 Multi-function Pin Selection
     * |[16:19] |PH12MFP   |PH.12 Multi-function Pin Selection
     * |[20:23] |PH13MFP   |PH.13 Multi-function Pin Selection
     * |[24:27] |PH14MFP   |PH.14 Multi-function Pin Selection
     * |[28:31] |PH15MFP   |PH.15 Multi-function Pin Selection
    */
    __IO uint32_t GPH_MFPH;

    /**
     * GPI_MFPL
     * ===================================================================================================
     * Offset: 0x70  Port I Low Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PI0MFP    |PI.0 Multi-function Pin Selection
     * |[4:7]   |PI1MFP    |PI.1 Multi-function Pin Selection
     * |[8:11]  |PI2MFP    |PI.2 Multi-function Pin Selection
     * |[12:15] |PI3MFP    |PI.3 Multi-function Pin Selection
     * |[16:19] |PI4MFP    |PI.4 Multi-function Pin Selection
     * |[20:23] |PI5MFP    |PI.5 Multi-function Pin Selection
     * |[24:27] |PI6MFP    |PI.6 Multi-function Pin Selection
     * |[28:31] |PI7MFP    |PI.7 Multi-function Pin Selection
    */
    __IO uint32_t GPI_MFPL;

    /**
     * GPI_MFPH
     * ===================================================================================================
     * Offset: 0x74  Port I High Byte Multi-function Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:3]   |PI8MFP    |PI.8 Multi-function Pin Selection
     * |[4:7]   |PI9MFP    |PI.9 Multi-function Pin Selection
     * |[8:11]  |PI10MFP   |PI.10 Multi-function Pin Selection
     * |[12:15] |PI11MFP   |PI.11 Multi-function Pin Selection
     * |[16:19] |PI12MFP   |PI.12 Multi-function Pin Selection
     * |[20:23] |PI13MFP   |PI.13 Multi-function Pin Selection
     * |[24:27] |PI14MFP   |PI.14 Multi-function Pin Selection
     * |[28:31] |PI15MFP   |PI.15 Multi-function Pin Selection
    */
    __IO uint32_t GPI_MFPH;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE1[18];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * SRAM_INTCTL
     * ===================================================================================================
     * Offset: 0xC0  SRAM Failed Interrupt Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PERRIEN   |SRAM Parity Check Fail Interrupt Enable Control
     * |        |          |0 = SRAMF INT Disabled.
     * |        |          |1 = SRAMF INT Enabled when SRAM fail flag.
    */
    __IO uint32_t SRAM_INTCTL;

    /**
     * SRAM_STATUS
     * ===================================================================================================
     * Offset: 0xC4  SRAM Parity Check Error Flag
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |PERRIF0   |SRAM Parity Check Fail Flag
     * |        |          |0 = No first 1 SRAM fail.
     * |        |          |1 = First SRAM Fail.
     * |[1]     |PERRIF1   |SRAM Parity Check Fail Flag
     * |        |          |0 = 2nd SRAM fail.
     * |        |          |1 = 2nd SRAM Fail.
    */
    __IO uint32_t SRAM_STATUS;

    /**
     * SRAM0_ERRADDR
     * ===================================================================================================
     * Offset: 0xC8  SRAM Parity Check Error First Address1
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |PERRADDR  |First SRAM parity check fail address
    */
    __I  uint32_t SRAM0_ERRADDR;

    /**
     * SRAM1_ERRADDR
     * ===================================================================================================
     * Offset: 0xCC  SRAM Parity Check Error First Address2
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:31]  |PERRADDR  |2nd
     * |        |          |SRAM parity check fail address
    */
    __I  uint32_t SRAM1_ERRADDR;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE2[8];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * IRCTCTL
     * ===================================================================================================
     * Offset: 0xF0  IRC Trim Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0:1]   |FREQSEL   |Trim Frequency Selection
     * |        |          |This field indicates the target frequency of HIRC auto trim.
     * |        |          |If no any target frequency is selected (FREQSEL is 00), the HIRC auto trim function is disabled.
     * |        |          |During auto trim operation, if clock error detected with CESTOPEN is set to 1 or trim retry limitation count reached, this field will be cleared to 00 automatically.
     * |        |          |00 = Disable HIRC auto trim function.
     * |        |          |01 = Enable HIRC auto trim function and trim HIRC to 22.1184 MHz.
     * |        |          |10 = Enable HIRC auto trim function and trim HIRC to 24 MHz.
     * |        |          |11 = Reserved.
     * |[4:5]   |LOOPSEL   |Trim Calculation Loop
     * |        |          |This field defines that trim value calculation is based on how many 32.768 kHz clock.
     * |        |          |For example, if CALCLOOP is set as 00, auto trim circuit will calculate trim value based on the average frequency difference in 4 32.768 kHz clock.
     * |        |          |00 = Trim value calculation is based on average difference in 4 32.768 kHz clock.
     * |        |          |01 = Trim value calculation is based on average difference in 8 32.768 kHz clock.
     * |        |          |10 = Trim value calculation is based on average difference in 16 32.768 kHz clock.
     * |        |          |11 = Trim value calculation is based on average difference in 32 32.768 kHz clock.
     * |[6:7]   |RETRYCNT  |Trim Value Update Limitation Count
     * |        |          |This field defines that how many times the auto trim circuit will try to update the HIRC trim value before the frequency of HIRC locked.
     * |        |          |Once the HIRC locked, the internal trim value update counter will be reset.
     * |        |          |If the trim value update counter reached this limitation value and frequency of HIRC still doesn't lock, the auto trim operation will be disabled and FREQSEL will be cleared to 00.
     * |        |          |00 = Trim retry count limitation is 64.
     * |        |          |01 = Trim retry count limitation is 128.
     * |        |          |10 = Trim retry count limitation is 256.
     * |        |          |11 = Trim retry count limitation is 512.
     * |[8]     |CESTOPEN  |Clock Error Stop Enable Control
     * |        |          |0 = The trim operation is keep going if clock is inaccuracy.
     * |        |          |1 = The trim operation is stopped if clock is inaccuracy.
    */
    __IO uint32_t IRCTCTL;

    /**
     * IRCTIEN
     * ===================================================================================================
     * Offset: 0xF4  IRC Trim Interrupt Enable Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[1]     |TFAILIEN  |Trim Failure Interrupt Enable
     * |        |          |This bit controls if an interrupt will be triggered while HIRC trim value update limitation count reached and HIRC frequency still not locked on target frequency set by FREQSEL.
     * |        |          |If this bit is high and TFAILIF is set during auto trim operation, an interrupt will be triggered to notify that HIRC trim value update limitation count was reached.
     * |        |          |0 = Disable TFAILIF status to trigger an interrupt to CPU.
     * |        |          |1 = Enable TFAILIF status to trigger an interrupt to CPU.
     * |[2]     |CLKEIEN   |Clock Error Interrupt Enable Control
     * |        |          |This bit controls if CPU would get an interrupt while clock is inaccuracy during auto trim operation.
     * |        |          |If this bit is set to1, and CLKERRIF is set during auto trim operation, an interrupt will be triggered to notify the clock frequency is inaccuracy.
     * |        |          |0 = Disable CLKERRIF status to trigger an interrupt to CPU.
     * |        |          |1 = Enable CLKERRIF status to trigger an interrupt to CPU.
    */
    __IO uint32_t IRCTIEN;

    /**
     * IRCTISTS
     * ===================================================================================================
     * Offset: 0xF8  IRC Trim Interrupt Status Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |FREQLOCK  |HIRC Frequency Lock Status
     * |        |          |This bit indicates the HIRC frequency is locked.
     * |        |          |This is a status bit and doesn't trigger any interrupt.
     * |[1]     |TFAILIF   |Trim Failure Interrupt Status
     * |        |          |This bit indicates that HIRC trim value update limitation count reached and the HIRC clock frequency still doesn't be locked.
     * |        |          |Once this bit is set, the auto trim operation stopped and FREQSEL will be cleared to 00 by hardware automatically.
     * |        |          |If this bit is set and TFAILIEN is high, an interrupt will be triggered to notify that HIRC trim value update limitation count was reached.
     * |        |          |Write 1 to clear this to 0.
     * |        |          |0 = Trim value update limitation count does not reach.
     * |        |          |1 = Trim value update limitation count reached and HIRC frequency still not locked.
     * |[2]     |CLKERRIF  |Clock Error Interrupt Status
     * |        |          |When the frequency of external 32.768 kHz low-speed crystal or HIRC is shift larger to unreasonable value, this bit will be set and to be an indicate that clock frequency is inaccuracy
     * |        |          |Once this bit is set to 1, the auto trim operation stopped and FREQSEL will be cleared to 00 by hardware automatically if CESTOPEN is set to 1.
     * |        |          |If this bit is set and CLKEIEN is high, an interrupt will be triggered to notify the clock frequency is inaccuracy.
     * |        |          |Write 1 to clear this to 0.
     * |        |          |0 = Clock frequency is accuracy.
     * |        |          |1 = Clock frequency is inaccuracy.
    */
    __IO uint32_t IRCTISTS;
    /// @cond HIDDEN_SYMBOLS
    uint32_t RESERVE3[1];
    /// @endcond //HIDDEN_SYMBOLS


    /**
     * REGLCTL
     * ===================================================================================================
     * Offset: 0x100  Register Write-Protection Control Register
     * ---------------------------------------------------------------------------------------------------
     * |Bits    |Field     |Descriptions
     * | :----: | :----:   | :---- |
     * |[0]     |REGLCTL   |Register Write-Protection Disable Index (Read Only)
     * |        |          |0 = Write-protection Enabled for writing protected registers.
     * |        |          |Any write to the protected register is ignored.
     * |        |          |1 = Write-protection Disabled for writing protected registers.
     * |        |          |The Protected registers are:
     * |        |          |SYS_IPRST0: address 0x4000_0008
     * |        |          |SYS_BODCTL: address 0x4000_0018
     * |        |          |SYS_PORCTL: address 0x4000_0024
     * |        |          |PWRCON: address 0x4000_0200 (bit[6] is not protected for power wake-up interrupt clear)
     * |        |          |APBCLK bit[0]: address 0x4000_0208 (bit[0] is watchdog clock enable)
     * |        |          |CLKSEL0: address 0x4000_0210 (for HCLK and CPU STCLK clock source select)
     * |        |          |CLKSEL1 bit[1:0]: address 0x4000_0214 (for watchdog clock source select)
     * |        |          |NMI_SEL]: address 0x4000_0300 (for NMI source select)
     * |        |          |ISPCON: address 0x4000_5000 (Flash ISP Control register)
     * |        |          |ISPTRG: address 0x4000_5010 (ISP Trigger Control register)
     * |        |          |WTCR: address 0x4004_0000
     * |        |          |FATCON: address 0x4000_5018
     * |        |          |TAMPER: address 0x400E_1000
     * |[0:7]   |SYS_REGLCTL|Register Write-Protection Code (Write Only)
     * |        |          |Some registers have write-protection function.
     * |        |          |Writing these registers have to disable the protected function by writing the sequence value "59h", "16h", "88h" to this field.
     * |        |          |After this sequence is completed, the REGLCTL bit will be set to 1 and write-protection registers can be normal write.
    */
    __IO  uint32_t REGLCTL;

} SYS_T;

/**
    @addtogroup SYS_CONST SYS Bit Field Definition
    Constant Definitions for SYS Controller
@{ */

#define SYS_PDID_SYS_PDID_Pos            (0)                                               /*!< SYS_T::PDID: SYS_PDID Position            */
#define SYS_PDID_SYS_PDID_Msk            (0xfffffffful << SYS_PDID_SYS_PDID_Pos)           /*!< SYS_T::PDID: SYS_PDID Mask                */

#define SYS_RSTSTS_PORF_Pos              (0)                                               /*!< SYS_T::RSTSTS: PORF Position              */
#define SYS_RSTSTS_PORF_Msk              (0x1ul << SYS_RSTSTS_PORF_Pos)                    /*!< SYS_T::RSTSTS: PORF Mask                  */

